{"title":"Turkey Bone Broth","directions":["Preheat the oven to 375°F.","Remove the breasts, thighs, and wings from the turkey carcass. Spread the turkey parts out in an even layer on a large baking sheet, along with the neck and any innards that came with the turkey. Dust everything  with sea salt and place in the preheated oven. Roast until golden brown, about 40 minutes.","Transfer everything from the baking sheet to a large stockpot or slow cooker. Cover with the water and bring to a boil over medium-high heat, then reduce the heat to medium. Skim off the fat and scum that rises to the top and discard; this process takes about 1 hour. Add vinegar, peppercorns, thyme, and rosemary.","Continue to simmer for 8 hours, adding water as necessary just to keep the bones covered. Add vegetables in the last 5 hours of cooking.","Gently strain or ladle the liquid through a fine-mesh strainer into a container. Fill your sink with ice water. Place the container of broth in the ice bath to cool for 1 hour. Use the broth right away, or cover and refrigerate for up to 1 week, or freeze for up to 1 year."],"fat":2.0,"date":"2015-12-07T20:28:00.000Z","categories":["HarperCollins","turkey","Soup/Stew","Kid-Friendly","Healthy","Thanksgiving"],"calories":50.0,"desc":"Who doesn\u0027t love roasted turkey?! Everything about it warms the soul—the smell, the taste, the post-Thanksgiving dinner food coma. This recipe captures all of these associations, save the food coma, into a perfectly delightful sipping broth.","protein":7.0,"rating":0.0,"ingredients":["1 whole turkey, trimmed, innards reserved","Sea salt, as needed","20 cups water, or as needed to cover ingredients","2 onions, peeled and chopped","1 carrot, chopped","1 celery stalk, chopped","2 bay leaves","1 teaspoon black peppercorns","4 sprigs fresh thyme","4 sprigs fresh rosemary","2 tablespoons apple cider, white, or white wine vinegar"],"sodium":66.0}
{"title":"Two-Bean Turkey Chili","directions":["1. In a skillet, heat oil over medium heat. Add onions and celery and cook, stirring, until celery is softened, about 5 minutes. Add garlic and cook, stirring, for 1 minute. Add cumin, oregano, peppercorns and lime zest and cook, stirring, for 1 minute. Add cornmeal and toss to coat. Add broth and cook, stirring, until mixture boils, about 1 minute. Add tomatoes with juice and return to a boil. MAKE AHEAD: Complete Step 1. Cover and refrigerate for up to 2 days. When you\u0027re ready to cook, continue with the recipe.","2. Transfer to slow cooker stoneware. Stir in turkey, pinto beans and green beans. Cover and cook on Low for 6 hours or on High for 3 hours, until turkey is tender and mixture is bubbly. Add chile powder solution, green and red bell peppers, mild green chiles, and jalapeño pepper, if using. Cover and cook on High for 30 minutes, until bell peppers are tender."],"fat":12.0,"date":"2012-01-12T16:46:46.000Z","categories":["Soup/Stew","Slow Cooker","Bean","Garlic","Pepper","Tomato","turkey","Super Bowl","Dinner","Lunch","Green Bean","Bell Pepper","Hot Pepper","Tailgating","Poker/Game Night","Jalapeño","Party","Poblano","Dairy Free","Wheat/Gluten-Free","Peanut Free","Tree Nut Free","Soy Free","No Sugar Added","Kosher"],"calories":511.0,"desc":"This tasty chili, which has just a hint of heat, is perfect for family get-togethers. Add a tossed green salad, sprinkled with shredded carrots, and whole-grain rolls.","protein":41.0,"rating":4.375,"ingredients":["4 cups cooked pinto beans (see tips)","1 tbsp oil","2 onions, finely chopped","2 stalks celery, thinly sliced","6 cloves garlic, minced","1 tbsp ground cumin (see tips)","2 tsp dried oregano","1/2 tsp cracked black peppercorns","Zest of 1 lime","2 tbsp fine cornmeal","1 cup chicken or turkey broth","1 can (28 oz/796 mL) tomatoes with juice, coarsely chopped","2 lbs skinless boneless turkey breast, cut into 1/2-inch (1 cm) cubes (see tips)","2 cups frozen sliced green beans","1 tbsp New Mexico or ancho chile powder, dissolved in 2 tbsp (30 mL) lime juice","1 green bell pepper, diced","1 red bell pepper, diced","1 can (4 1/2 oz or 127 mL) diced mild green chiles","1 jalapeño pepper or chipotle pepper in adobo sauce, diced, optional","Medium to large (31⁄2 to 6 quart) slow cooker"],"sodium":245.0}
{"title":"Grill-Smoked Salmon","directions":["Build a fire in a smoker/grill for indirect heat. Maintain a temperature of about 300°F.","Put each fish in an aluminum foil roasting pan, bending the short ends if necessary to lay the fish flat. Place the fish \"boats\" in the cooker on the side opposite the coals.","Smoke the fish for about 35 minutes. (Smaller fish will take 8 to 10 minutes per inch of thickness.) The salmon is done when it is almost opaque throughout but still pink in the center. (If substituting white fish, cook until opaque throughout.)","Remove the salmon from the smoker. Transfer to a cutting board and fillet or cut into steaks, or place on a large platter and carve at the table."],"fat":42.0,"date":"2007-04-03T22:22:07.000Z","categories":["Fish","Picnic","Backyard BBQ","Salmon","Summer","Grill/Barbecue"],"calories":649.0,"desc":"Editor\u0027s note: The recipe and introductory text below are from Extreme Barbecue: Smokin\u0027 Rigs and Real Good Recipes, by Dan Huntley and Lisa Grace Lednicer. To read Epicurious\u0027s review of the cookbook, go to Summer Cooking Guides.","protein":64.0,"rating":4.375,"ingredients":["3 whole gutted salmon, each about 2 1/2 pounds and 4 inches thick, head on or off"],"sodium":184.0}
{"title":"Tequila and Lime Chicken Tacos","directions":["In the slow cooker, combine all the ingredients except the tortillas and toppings.","Cover and cook on low for 8 hours or on high for 4 hours.","Transfer the chicken to a cutting board and shred it using two forks. Return the shredded chicken to the slow cooker and stir to blend.","Warm the tortillas in a dry skillet over medium heat and fill them with the chicken mixture. Serve with the toppings."],"fat":11.0,"date":"2016-01-30T22:30:00.000Z","categories":["Slow Cooker","Dinner","Tequila","Chicken","Lime Juice","Taco","Chile Pepper","Tortillas"],"calories":383.0,"desc":"This dish is made with chicken thighs, which have more flavor than chicken breasts but you can substitute chicken breasts if you like. The meat needs to be raw for this dish so it can absorb more of the flavor as it cooks. Although the recipe calls for tequila, you can substitute beer, orange juice, or pineapple juice if you prefer. The liquid smoke is optional, but it does add a nice extra kick of smoky flavor. Serve this dish with rice, refried beans, and frozen margaritas or a frosty glass of beer.","protein":26.0,"rating":5.0,"ingredients":["1 1/2 pounds boneless, skinless chicken thighs","3/4 cup tequila","1/4 cup fresh lime juice","2 garlic cloves","2 tablespoons chopped chipotles in adobo","1 tablespoon chili powder","2 teaspoons liquid smoke (optional)","1 teaspoon ground cumin","1 teaspoon dried oregano","1 teaspoon ancho chile powder","1/2 teaspoon smoked paprika","12 corn tortillas","Chopped red onion","Chopped avocado","Chopped cilantro","Grated quesadilla cheese","Red salsa or pico de gallo","6 lime wedges"],"sodium":241.0}
{"title":"Carolina-Style Pork BBQ Sandwiches","directions":["Spray the inside of a slow cooker with cooking spray.","Put the onions in the slow cooker. Make slits in the pork roast and insert\nthe garlic cloves. Rub salt, pepper, brown sugar, and red pepper flakes into\nthe meat. Place the pork in the slow cooker fat side up and pour in the\nvinegar and apple cider. Cover and cook on low for at least 10 hours and up\nto 12 hours, until the meat is falling-apart tender.","Transfer the meat to a large bowl and shred it with two forks. Set aside.","Pour 2 cups of the pan juices into a measuring cup; discard any leftover juices still in the pot. Let cool and skim off any visible fat. Pour this liquid into a saucepan. Add the water, ketchup, cider vinegar, brown sugar, Worcestershire sauce, chili powder, paprika, dry mustard, and red pepper flakes. Bring to a boil and simmer, uncovered, for 10 minutes. Season with salt and pepper. Return the shredded pork to the slow cooker and add 1 cup of the sauce mixture (more if you like it wet). Give it a stir and set the slow cooker to warm until ready to serve.","Serve the pork straight from the slow cooker with a slotted spoon, along\nwith buns, slaw, and hot sauce. Serve the additional sauce on the side."],"fat":16.0,"date":"2016-08-04T15:23:16.782Z","categories":["Pork","Sandwich","Grill/Barbecue","North Carolina"],"calories":422.0,"desc":"Arguably, some of the best ‘cue in the country can be found in North Carolina, where two distinct types of slow-cooked\npig prevail. The first is Eastern barbecue, which is distinguished by slow-cooking a whole hog and including\nboth the white and dark meat in chopped sandwiches and platters. Eastern ‘cue boasts just a hint of vinegar and\nred pepper, which is added to the meat mix rather than used as a sauce. Western North Carolina ‘cue (aka Lexington-style)\nis made from pork shoulder only. In addition to incorporating plenty of vinegar, sugar, and spices, it also mixes\nin a good amount of ketchup to create an actual sauce for the pork. This slow-cooker recipe falls somewhere in between.\nIf you like, you can skip the sauce altogether and enjoy a basic roasted pork, which is not only fantastic on\na bun with slaw and hot sauce, but is great for making burritos, barbecue pizza, or nachos.\nI recommend using a 5- to 6-quart slow cooker for this recipe in order to comfortably fit the pork shoulder. You can\nalso cut this recipe in half and use a smaller slow cooker.","protein":55.0,"rating":5.0,"ingredients":["2 large onions, sliced","5-pound boneless pork shoulder roast","6 cloves garlic, smashed","1 teaspoon salt","1/2 teaspoon black pepper","2 tablespoons brown sugar","1 1/2 teaspoons dried red pepper flakes","1 cup cider vinegar","1 cup apple cider or apple juice","2 cups cooking liquid (reserved from the slow-cooked pork)","1/2 cup water","1/4 cup ketchup","1/4 cup cider vinegar","2 teaspoons brown sugar","1 1/2 teaspoons Worcestershire sauce","1 1/2 teaspoons chili powder","1 teaspoon paprika","1 teaspoon dry mustard powder","1/4 teaspoon red pepper flakes","Salt and black pepper","Buns, slaw, and hot sauce"],"sodium":1370.0}
{"title":"Beef Bone Broth","directions":["Preheat oven to 450°F. Place beef bones, carrots, leek, onion, and garlic on a roasting pan or rimmed baking sheet and roast for 20 minutes. Toss the contents of the pan and continue to roast until deeply browned, about 20 minutes more.","Fill a large (at least 6-quart) stockpot with 12 cups of water (preferably filtered) . Add celery, bay leaves, peppercorns, and vinegar. Scrape the roasted bones and vegetables into the pot along with any juices. Add more water if necessary to cover bones and vegetables.","Cover the pot and bring to a gentle boil. Reduce heat to a very low simmer and cook with lid slightly ajar, skimming foam and excess fat occasionally, for at least 8 but up to 24 hours on the stovetop. The longer you simmer it, the better your broth will be. Add more water if necessary to ensure bones and vegetables are fully submerged. Alternately, you can cook the broth in a slow cooker on low for the same amount of time.","Remove the pot from the heat and let cool slightly. Strain broth using a fine-mesh sieve and discard bones and vegetables. Let continue to cool until barely warm, then refrigerate in smaller containers overnight. Remove solidified fat from the top of the chilled broth."],"fat":17.0,"date":"2014-12-31T04:00:00.000Z","categories":["Soup/Stew","Beef","Garlic","Onion","Celery","Carrot"],"calories":318.0,"desc":"The longer you cook this nourishing broth, the more savory and concentrated it will become. Roasting the bones and vegetables beforehand will add even more flavor and richness. Season and sip this restorative broth on its own, use it as a cooking liquid for grains or legumes, or deploy it as a base for sauces and soups like hearty, healthy Detox Pho.","protein":28.0,"rating":4.375,"ingredients":["4 pounds beef bones, preferably a mix of marrow bones and bones with a little meat on them, such as oxtail, short ribs, or knuckle bones (cut in half by a butcher)","2 medium unpeeled carrots, cut into 2-inch pieces","1 medium leek, end trimmed, cut into 2-inch pieces","1 medium onion, quartered","1 garlic head, halved crosswise","2 celery stalks, cut into 2-inch pieces","2 bay leaves","2 tablespoons black peppercorns","1 tablespoon cider vinegar","6-quart (or larger) stockpot or a large slow cooker"],"sodium":373.0}
{"title":"Corn and Chicken Poblano Braised Chicken","directions":["Put onion and garlic in slow cooker. Top with chicken and season with 1 teaspoon salt and 1/2 teaspoon pepper. Layer poblanos and corn over chicken and season with 1/2 teaspoon salt and 1/4 teaspoon pepper. Cover and cook according to manufacturer\u0027s instructions (chicken should be falling off the bone).","Lift chicken from cooking liquid and transfer to serving bowls. Whisk sour cream and cilantro into cooking liquid, then spoon over chicken. Season with salt and pepper."],"fat":152.0,"date":"2010-03-10T04:00:00.000Z","categories":["Soup/Stew","Slow Cooker","Chicken","Garlic","Dinner","Corn","Potluck","Sour Cream","Cilantro","Poblano","Gourmet","Wheat/Gluten-Free","Peanut Free","Tree Nut Free","Soy Free","No Sugar Added"],"calories":2193.0,"desc":"There\u0027s no need to introduce any liquid to the slow cooker—as the chicken legs and vegetables cook, they release their juices to make a very savory stew. Whisking in some sour cream just before serving adds body to the sauce, and fresh cilantro brings brightness to this no–hassle one–dish dinner. Poblano chiles have notoriously tough skins, but we were happily surprised to learn that several hours of gentle cooking makes the skins practically melt away.","protein":180.0,"rating":3.75,"ingredients":["1 large white onion, chopped","5 garlic cloves, finely chopped","6 whole chicken legs","1/2 pound fresh poblano chiles (about 4), stems, seeds, and ribs removed and chiles chopped","3 ears corn, kernels cut from cobs","1/2 cup sour cream","3/4 cup chopped cilantro","Equipment: a 5- to 6-quart slow cooker","Accompaniment: white rice"],"sodium":697.0}
{"title":"Braised Lamb Shanks with Garlic and Rosemary","directions":["In a small bowl mix the red wine, mustard, salt, and pepper and place in the insert of the slow cooker. Layer the shanks in the insert so they fit. Scatter the remaining ingredients around and on the shanks. Cover and cook on HIGH for 6 hours. Use tongs to reverse the position of the shanks, top to bottom. Reduce the setting to LOW and cook for an additional 6 hours.","Use a slotted spoon to transfer the shanks to a serving platter. Skim the fat from the cooking juices, taste, and add salt and pepper, if needed. Pour the juices over the shanks, and serve.","For a less assertive garlic taste, use elephant garlic."],"fat":56.0,"date":"2004-08-20T04:00:00.000Z","categories":["Garlic","Herb","Lamb","Braise","Dinner","Rosemary","Lamb Shank","Winter","Sugar Conscious","Paleo","Dairy Free","Wheat/Gluten-Free","Peanut Free","Tree Nut Free","Soy Free"],"calories":889.0,"desc":"Cooking Time: 6 hours on HIGH plus another 6 hours on LOW\nSlow Cooker Size: 5 quart","protein":79.0,"rating":3.75,"ingredients":["1/2 cup dry red wine","2 heaping tablespoons Dijon mustard","2 teaspoons kosher or coarse sea salt","1 teaspoon freshly ground black pepper","5 to 6 pounds lamb shanks, not trimmed of fat","1 large, firm head garlic (about 15 cloves), separated into cloves, each crushed and peeled (see Note)","2 medium yellow onions, peeled and coarsely chopped","1 large carrot, peeled and cut in 1/4-inch slices","Finely grated zest of 1 large lemon","2 heaping tablespoons coarsely chopped fresh rosemary leaves"],"sodium":1016.0}
{"title":"Slow Cooker Bone Broth","directions":["1. Place the beef bones in the slow cooker, and place the remaining ingredients on top.","2. Add enough water to the slow cooker to cover everything.","3. Cover, set the slow cooker to high, and cook for 24–72 hours.","4. Strain the liquid, place in the refrigerator to cool, remove the solidified fat from the top, and use as desired."],"fat":2.0,"date":"2015-04-23T04:00:00.000Z","categories":["Soup/Stew","Beef","Onion","Kid-Friendly","Celery","Carrot","Parsley","Weelicious"],"calories":30.0,"desc":"","protein":3.0,"rating":0.0,"ingredients":["10–12 pounds beef bones","2 tablespoons apple cider vinegar","2 onions, peeled and quartered","2 carrots, peeled and cut in half","2 celery stalks, cut in half","2 bay leaves","2 tablespoons peppercorns","4 stems parsley","1 teaspoon salt"],"sodium":49.0}
{"title":"Ropa Vieja","directions":["1. Stir the tomatoes, onion, celery, peppers, olives, raisins, tomato paste, oregano, cumin, salt, and bay leaf in the slow cooker until the tomato paste dissolves into the mix.","2. Nestle the skirt steak(s) into the sauce, cutting large steaks to fit the size of your slow cooker and overlapping them as necessary without folding the steaks over onto themselves. In the end, they should all be submerged in the sauce.","3. Cover and cook on low for 9 hours, or until the beef in so tender it can be shredded with a fork. Remove the bay leaf and use two forks to shred the meat completely. Stir in the vinegar before serving."],"fat":16.0,"date":"2015-05-26T04:00:00.000Z","categories":["Olive","Onion","Pepper","Tomato","Kid-Friendly","Steak","Celery"],"calories":259.0,"desc":"","protein":24.0,"rating":0.0,"ingredients":["1 1/3 cups drained no-salt-added canned diced tomatoes","1 cup thinly sliced yellow onion","2 medium celery ribs, thinly sliced","2/3 cup stemmed, seeded, and thinly sliced cubanelle peppers","1/3 cup thinly sliced pitted green olives","2 tablespoons golden raisins","4 teaspoons no-salt-added tomato paste","1 tablespoon dried oregano","2 teaspoons ground cumin","1/2 teaspoon salt","1 bay leaf","2 pounds skirt steak","4 teaspoons sherry vinegar"],"sodium":373.0}
{"title":"Chicken with Dumplings","directions":["Arrange chicken in a large kettle or pressure cooker. If you are using the kettle, add one of the onions stuck with the cloves, the peppercorns thyme, salt and water. Cover, bring to a boil, and simmer gently for 2 hours or until chicken is very tender. Add remaining vegetables during last hour. If you are using a pressure cooker, add only 1 1/2 cups water, place all the vegetables in the cooker with the chicken at the beginning, bring to 15 pounds pressure, cook for 35 minutes, let cool before removing petcock.","Meanwhile, mix the batter for the dumplings, using the biscuit mix, egg and milk. When chicken is cooked, place dumplings over the top of chicken and vegetables, turn on heat once more, cook covered for 12 minutes or until dumplings are puffed. Serve dumplings in place of potatoes, spooning the rich chicken broth over the top of each serving."],"fat":27.0,"date":"2004-08-20T04:00:00.000Z","categories":["Pressure Cooker","Chicken","Onion","Kid-Friendly","Carrot","Parsnip","Winter","House \u0026 Garden"],"calories":563.0,"desc":"","protein":54.0,"rating":3.125,"ingredients":["5 pound stewing chicken, cut up","12 small white onions, peeled","2 whole cloves","4 peppercorns","1/4 teaspoon thyme, crushed","1 tablespoon salt","3 cups water","2 large carrots, scraped, cut in 2\" pieces","2 parsnips, cut in 2\" pieces","1 cup biscuit mix","1 egg","1/2 cup milk"],"sodium":1275.0}
{"title":"Seafood Spaghetti","directions":["Put octopus in pressure cooker with water, bay leaf, and 1/2 teaspoon salt and seal pressure cooker with lid, then cook at high pressure according to manufacturer\u0027s instructions 10 minutes. Put pressure cooker in sink (do not remove lid) and run cold water over lid until pressure goes down completely. Remove lid. Transfer octopus to a cutting board, reserving 1/2 cup cooking liquid. Cut off and discard head, then cut tentacles into 1-inch pieces.","Simmer tomatoes with their juice, basil, and oil in a heavy medium saucepan over medium heat, uncovered, stirring and mashing tomatoes occasionally, until thick and reduced to about 3/4 cup, 20 to 25 minutes.","Purée basil, oil, butter, and 1/2 teaspoon salt in a blender, scraping down side as necessary, until smooth. Transfer to a small bowl.","Cook spaghetti in a pasta pot of boiling salted water (3 tablespoons salt for 6 quarts water) until al dente.","Meanwhile, purée garlic and oil in cleaned blender until smooth. Heat a dry 12-inch heavy skillet (not nonstick) over high heat until hot, 2 to 3 minutes. Add oil mixture, then immediately add octopus, shrimp, and mussels and sauté, stirring occasionally, until shrimp are browned on edges and mussels begin to open, 2 to 3 minutes. Add tomato sauce and reserved octopus-cooking liquid and cook, stirring, until mussels just open wide and shrimp are just cooked through, about 2 minutes more (discard any unopened mussels). Season with salt and pepper.","Drain pasta and return to pot. Add squid to hot seafood in skillet, stirring to combine, then add to hot pasta and toss to combine (squid will cook as it is being tossed). Serve drizzled with all of basil purée."],"fat":33.0,"date":"2007-11-16T19:39:40.000Z","categories":["Blender","Pressure Cooker","Garlic","Pasta","Tomato","Lunch","Basil","Mussel","Octopus","Shrimp","Squid","Gourmet","Sugar Conscious","Pescatarian","Peanut Free","Tree Nut Free","Soy Free","No Sugar Added"],"calories":819.0,"desc":"Espagueti Frutos del Mar","protein":59.0,"rating":3.75,"ingredients":["2 pound cleaned frozen octopus, thawed and rinsed","2 cups water","1 Turkish or 1/2 California bay leaf","1 (14- to 15-ounce) can whole tomatoes in juice, drained, reserving juice, and coarsely chopped","2 tablespoons chopped basil","2 tablespoons extra-virgin olive oil","3/4 cup packed basil leaves","1/4 cup extra-virgin olive oil","1 tablespoon unsalted butter, softened","1 pound spaghetti","6 garlic cloves","1/3 cup extra-virgin olive oil","1 pound large shrimp in shell, peeled, leaving tail fan attached, and deveined","3/4 pound cultivated mussels, rinsed","3/4 pound baby squid, cleaned, bodies cut into 1/4-inch rounds, and tentacles left whole","Equipment: a pressure cooker"],"sodium":1051.0}
{"title":"Chicken Bone Broth","directions":["Preheat  the oven to 350°F.","Remove the wings, thighs, drumsticks, and breasts from the chickens.","Place the carcasses, wings, necks, and innards that came inside the chicken on a baking sheet and place in the preheated oven. Roast until golden brown, 20 to 25 minutes. For a lighter flavor, skip this step. If you\u0027re planning to drink the broth by itself, or with herbs or seasonings, this step adds a nice depth of flavor, umami, and richness our tongues can\u0027t get enough of.","Place the bones, feet, and vinegar in a stockpot or slow cooker, at least 10 quarts in size, and cover with the cold water. If using a stockpot, bring the water to a boil over high heat. If using a slow cooker, turn the temperature to high. Once simmering, reduce heat to low, cook for 30 minutes, skimming and discarding the scum that rises to the top. Add the ice and skim off any fat that congeals on the top along with any other scum or impurities. Simmer uncovered for 12 to 15 hours, adding more water as necessary just to keep the bones covered.","Add the carrots, onions, thyme, rosemary, and bay leaves and simmer for another 5 hours. Continue to skim off any impurities; add water as necessary to keep the ingredients covered.","Gently strain or ladle the liquid through a fine-mesh strainer into a container. Fill your sink with ice water. Place the container of broth in the ice bath to cool for about 1 hour. Use the broth right away, or cover and refrigerate for up to 1 week, or freeze for up to 1 year.","Remove any fat that has solidified on the top before using. You may discard this fat or use it as you would any other cooking fat."],"fat":2.0,"date":"2015-12-01T20:30:00.000Z","categories":["HarperCollins","Soup/Stew","Chicken","Carrot","Onion","Herb","Winter"],"calories":35.0,"desc":"This is how we make chicken bone broth at home. If you\u0027d like, you can switch out the herbs and vegetables for others you prefer. For example, you could add leeks, celery, or a different type of onion. Roast the vegetables first for added depth of flavor and color.","protein":3.0,"rating":0.0,"ingredients":["2 whole chickens","1 pound chicken feet","1/4 cup apple cider, white, or white wine vinegar","6 to 8 quarts cold water, or as needed to cover ingredients","4 cups ice cubes","3 carrots, peeled and halved","4 onions, peeled and halved","3 sprigs fresh thyme","3 sprigs fresh rosemary","3 bay leaves"],"sodium":55.0}
{"title":"Roasted Apricot Chicken with Mint and Sage Butternut Squash","directions":["Prepare the rub and the chicken: Preheat the oven to 375°.","In a large mixing bowl, combine the cinnamon, cumin, turmeric, paprika, sea salt, and ghee or oil. Add the chicken to the bowl and, using your hands, work the rub into the chicken, ensuring the entire chicken is coated.","In a deep cast-iron pot or slow cooker, combine the tomatoes, apricots, garlic, raisins, and broth. Place the chicken on top of the veggies and place the pot in the oven for 50 minutes, or until the chicken reaches an internal temperature of 150°F.","Remove the chicken from the pot and set aside to rest for 15 minutes. Bring the pot with the veggies and broth to a simmer over medium-low heat. Simmer for 10 to 15 minutes or until reduced by half and thickened.","Meanwhile, prepare the butternut squash: Toss the squash with the olive oil, sea salt, fresh sage, and mint. Spread out in an even layer on a baking sheet and roast in the preheated oven for 15 minutes, or until knife-tender.","To finish the dish: Using a large knife and fork, carve the chicken meat from the carcass. Cut the chicken into bite-size pieces and mix thoroughly into the simmering sauce. Remove from the heat and serve over the roasted butternut squash.","Store leftover, refrigerated, for up to 1 week."],"fat":70.0,"date":"2015-12-08T20:29:33.128Z","categories":["HarperCollins","Chicken","Dinner","Butternut Squash","Kid-Friendly","Low Fat","Apricot","Healthy","Wheat/Gluten-Free","Peanut Free","Tree Nut Free","Soy Free","No Sugar Added"],"calories":1070.0,"desc":"Roasting the whole bird is our favorite way to cook chicken for a few reasons. It\u0027s super easy, it produces juicy and tender meat, and it\u0027s the best bang for your buck. And, you can cook up a batch of bone broth with all the leftover bones!","protein":86.0,"rating":5.0,"ingredients":["1 teaspoon ground cinnamon","1/2 teaspoon ground cumin","1 teaspoon ground turmeric","1 1/2 teaspoon Spanish paprika","1 teaspoon sea salt","1 teaspoon ghee or olive oil","1 (4- to 6-pound) whole chicken","3 plum tomatoes, cut into small dice","1/2 cup chopped dried Turkish apricots","4 large garlic cloves, minced","1/4 cup golden raisins","3 cups Chicken Bone Broth","1 butternut squash, peeled, cut in half, and seeds removed, cut into small dice","1 teaspoon olive oil","1 tablespoon roughly chopped fresh sage","1 tablespoon roughly chopped fresh mint","2 teaspoons sea salt"],"sodium":1297.0}
{"title":"Slow-Cooker Marrakech Chicken Stew With Preserved Lemon and Olives","directions":["Heat a medium skillet, preferably cast-iron, over medium-high heat. Add the cumin seed and stir until aromatic, about 30 seconds. Turn off the heat, add the coriander seed, and stir for 30 seconds. Scrape the spices into a mortar with a pestle or into a spice grinder and grind until the cumin and coriander are coarsely ground. Mix with the flour, salt, and pepper in a medium large mixing bowl and dredge the chicken pieces in the seasoned flour mixture; pat off the excess flour and reserve the mixture.","Heat the oil in an extra-large skillet over medium-high heat; brown the chicken pieces on both sides, in batches, about 3 minutes per side, then transfer to a 5- to 6-quart slow cooker.","Reduce the heat under the skillet to medium. Add the onions and sauté until tender, about 2 minutes. Add the garlic and the reserved seasoned flour mixture and stir until the flour is lightly toasted, about 3 minutes. Add the wine and chicken broth and stir until the sauce is slightly thickened. Remove from the heat and stir in the lemon zest (but not the juice).","Pour over the chicken and scatter the chopped preserved lemon over the top. Cover the cooker and cook for 2 to 3 hours on high, or 4 to 6 hours on low, until an instant-read thermometer inserted into the thickest part of one of the uppermost pieces of chicken registers 170°F. Keep warm for as long as 4 hours.","Remove the chicken to a platter. Stir the lemon juice, parsley, and olives into the sauce, and spoon over the chicken."],"fat":79.0,"date":"2016-10-06T18:22:00.000Z","categories":["Slow Cooker","Chicken","Lemon","Dinner","Olive"],"calories":1200.0,"desc":"This pungent, fragrant chicken stew is not for the weak of palate. Radiating the aromas of toasted cumin and coriander, and spiked with the salty-sour pucker of cured lemons and olives, it produces a heady and exotic effect. If you can’t find preserved lemons in your local food markets (high-end stores usually stock them), you can order them or make them yourself.","protein":90.0,"rating":0.0,"ingredients":["1 tablespoon cumin seed","2 teaspoons coriander seed","1/2 cup flour","1 teaspoon salt","1 teaspoon ground black pepper","4 pounds chicken pieces, or 1 cut-up chicken, skin removed","2 tablespoons extra-virgin olive oil","2 onions, chopped","2 cloves garlic, minced","1/2 cup white wine","1 1/2 cups chicken broth","Juice and finely grated zest of 1 lemon","1 preserved lemon, homemade or purchased, finely chopped","1/4 cup chopped fresh Italian (flat-leaf) parsley","1/2 cup pitted kalamata olives","5–6 quart slow cooker"],"sodium":1147.0}
{"title":"Spiced Chicken Stew with Carrots","directions":["Season chicken with salt and pepper. In a 5–to 6-quart slow cooker with a browning option, brown chicken in oil; transfer to a plate. (If your slow cooker doesn\u0027t have a browning option, just remove skin from the chicken.) Add carrots, garlic, cinnamon stick, and cumin to pot. Place chicken on top. Cover and cook on high until chicken is cooked through, 4 hours (or 8 hours on low), adding raisins 15 minutes before done.","Using a slotted spoon, transfer chicken and carrots to a serving dish (remove cinnamon stick); top with cilantro and almonds. Season cooking liquid with salt and pepper. Spoon over chicken before serving."],"fat":48.0,"date":"2015-05-26T04:00:00.000Z","categories":["Chicken","Kid-Friendly","Dinner","Carrot","Paleo","Dairy Free","Wheat/Gluten-Free","Peanut Free","Soy Free","No Sugar Added","Kosher"],"calories":752.0,"desc":"We use a slow cooker with a browning option to crisp the chicken skin for this Moroccan-flavored dish. The stew is great on its own by couscous would be an easy and fitting side dish.","protein":50.0,"rating":3.75,"ingredients":["8 bone-in chicken thighs (about 2 1/2 pounds total)","Coarse salt and freshly ground pepper","2 tablespoons olive oil (optional)","2 pounds carrots, cut into 1 1/2-inch lengths","1 garlic clove, thinly sliced","1 cinnamon stick","1/2 teaspoon ground cumin","1/4 cup golden raisins","1/2 cup fresh cilantro leaves","1/4 cup sliced almonds, toasted (optional)"],"sodium":391.0}
{"title":"Easy Slow-Cooker Pot Roast","directions":["To make the rub: In a small bowl, combine the paprika, rosemary, garlic powder, salt, and pepper.","To make the beef: Pat the chuck roast dry with a paper towel to remove excess moisture. Evenly pat the rub on all sides of the roast.","In a large skillet, heat the olive oil over high heat. Add the seasoned roast and sear on each side for 2 to 3 minutes.","Transfer the roast to a slow cooker. Place the carrots, onion, celery, and potatoes around the roast.","In a small bowl, whisk together the beef broth, vinegar, and garlic.","Add the beef broth mixture and the bay leaves to the slow cooker. Cover and cook for 4 hours on high or 8 hours on low. Remove the bay leaves before serving."],"fat":24.0,"date":"2016-03-01T19:34:00.000Z","categories":["HarperCollins","Beef","Roast","Braise","Slow Cooker","Dinner","Potato","Carrot","Dairy Free","Wheat/Gluten-Free","Peanut Free","Tree Nut Free","Soy Free","No Sugar Added","Kosher"],"calories":443.0,"desc":"I used to shy away from making pot roasts for my family because choosing the right cut of beef among all the various cuts seemed overwhelming. Take it from me, picking up a relatively inexpensive chuck roast (like the one I use here) provides a moist, juicy, and tender roast every time.","protein":34.0,"rating":3.125,"ingredients":["1/2 tablespoon paprika","1 tablespoon chopped fresh rosemary","2 teaspoons garlic powder","1 teaspoon kosher salt","1 teaspoon black pepper","2 pounds boneless chuck roast, trimmed","1 tablespoon extra virgin olive oil","2 cups whole baby carrots","1 medium onion, cut into large dice","3 stalks celery, chopped","8 red new potatoes, quartered","2 1/2 cups low-sodium beef broth (I like Pacific Organic)","2 tablespoons balsamic vinegar","1 tablespoon minced garlic","2 bay leaves"],"sodium":678.0}
{"title":"Tarragon Crab Salad","directions":["Blend yolk, vinegar, water, 1/2 teaspoon salt, and 1/4 teaspoon pepper in a blender. With motor running, add oil in a slow stream.","Toss crabmeat with dressing, tarragon, and chives.","Season tomatoes with salt and serve topped with romaine and crab"],"fat":13.0,"date":"2008-10-06T19:52:35.000Z","categories":["Salad","Blender","Tomato","No-Cook","Quick \u0026 Easy","Crab","Summer","Healthy","Tarragon","Chive","Lettuce","Gourmet"],"calories":241.0,"desc":"The keys to this fast, simple dish, which was inspired by a crab-stuffed tomato at Yves Camdeborde\u0027s Paris brasserie, Le Comptoir du Relais, are ripe tomatoes, fresh herbs, and excellent crabmeat.","protein":23.0,"rating":3.75,"ingredients":["1 large egg yolk","1 tablespoon white-wine vinegar","1 tablespoon water","3 tablespoons mild olive oil","1 pound jumbo lump crabmeat, picked over","2 teaspoons chopped tarragon","3 tablespoons chopped chives","2 large tomatoes (1 1/2 to 2 pounds total), sliced thick","3 cups baby romaine leaves","Toasted baguette slices"],"sodium":654.0}
{"title":"Deviled Crab with Sherry Sauce","directions":["Preheat oven to 450°F.","Remove crabmeat from shell, discarding cartilage, and cut meat into 1/2-inch pieces.","Melt 2 tablespoons butter in a 1 1/2-quart heavy saucepan over moderately low heat, then add flour and cook, whisking, 2 minutes. Add milk in a slow stream, whisking, then add garlic and bring to a boil, whisking. Reduce heat and simmer, whisking, until béchamel is thickened, about 3 minutes. Remove from heat and discard garlic.","Whisk together yolks, Sherry, mustard, nutmeg, cayenne, and salt in a bowl, then add hot béchamel in a slow stream, whisking. Pour mixture into saucepan and cook over very low heat, whisking constantly, until an instant-read thermometer registers 160°F, about 2 minutes. Remove from heat and gently stir in crabmeat and parsley. Divide mixture among 6 (4-ounce) ramekins.","Melt remaining 2 tablespoons butter and cool slightly. Stir together melted butter, bread crumbs, and cheese with a fork, then sprinkle over crab. Put ramekins in a shallow baking pan and bake in upper third of oven until crab is bubbling and crumbs are golden brown, about 5 minutes."],"fat":11.0,"date":"2004-08-20T04:00:00.000Z","categories":["Milk/Cream","Shellfish","Appetizer","Bake","Quick \u0026 Easy","Parmesan","Seafood","Crab","Ramekin","Gourmet"],"calories":252.0,"desc":"Active time: 20 min Start to finish: 25 min","protein":30.0,"rating":4.375,"ingredients":["2 lb cooked king crab legs in shell, thawed if frozen and shells split lengthwise","1/2 stick (1/4 cup) unsalted butter","2 tablespoons all-purpose flour","whole milk","1 large garlic clove, lightly crushed","2 large egg yolks","1/3 cup medium-dry Sherry","1/2 teaspoon dry mustard","1/8 teaspoon freshly grated nutmeg","1/8 teaspoon cayenne","1/2 teaspoon salt","2 tablespoons finely chopped fresh flat-leaf parsley","1/4 cup fine dry bread crumbs","1/4 cup finely grated Parmigiano-Reggiano (1/2 oz)"],"sodium":1334.0}
{"title":"Short-Grain Rice","directions":["1. Put the rice in a large bowl (or in the insert that fits into the rice cooker) and add enough water to submerge it by an inch. Use your fingers to stir the rice—stirring the rice like this will loosen the powdery rice starch from the grains and cloud the water. Tilt the bowl to drain the rice, using your hand to keep the rice from going down the drain with the water, and repeat until the rice no longer clouds the water.","2. If using a rice cooker, cook the rice according to the manufacturer\u0027s instructions. If cooking on the stovetop, put the rice in a medium saucepan with a lid, add the water, cover the pan, and bring to a boil over medium-high heat. Once the water boils, reduce the heat to low and cook, covered, until the rice has absorbed all the water in the pot, about 20 minutes.","3. Regardless of whether you\u0027ve cooked it on the stove or in a cooker, when the rice is ready, paddle it: we use a short, wide, wooden rice paddle to do so, but any wooden spoon will work. Just stir and fluff the rice, letting the steam escape, then let it sit for another 10 minutes with the lid of the pan or the cooker slightly ajar before serving."],"fat":0.0,"date":"2013-11-26T04:00:00.000Z","categories":["Rice"],"calories":234.0,"desc":"Editor\u0027s note: Use this recipe to make Chef David Chang\u0027s Bo Ssäm.","protein":4.0,"rating":1.25,"ingredients":["2 cups short-grain white rice (sometimes labeled \"sushi rice\")","2 cups water (if cooking on the stovetop)"],"sodium":4.0}
{"title":"Slow-Cooker Macaroni and Cheese","directions":["Coat a 3- to 4 1/2-quart slow cooker with nonstick cooking spray. Combine the low-fat and evaporated milks, egg, salt, and pepper in the cooker and whisk until smooth. Add the cheese and macaroni; gently stir with a rubber spatula to coat evenly with the milk and cheese mixture. Sprinkle the Parmesan on the top.","Cover and cook on low until the custard is set in the center and the pasta is tender, 3 1/2 to 4 hours. Do not cook more than 4 hours, as the sides will dry out and burn.","Macaroni and Italian Cheese: For the cheddar, substitute a combination of 1 cup of shredded fontina (4 ounces) and 1/2 cup of diced or shredded mozzarella (2 ounces).","Macaroni and Swiss Cheese: Substitute an equal amount of shredded Gruyère or Emmenthaler cheese for the cheddar.","Macaroni and Blue Cheese: Add 1/2 cup of crumbled Gorgonzola (2 ounces), Stilton, Roquefort, or American blue cheese to the cheddar and macaroni."],"fat":19.0,"date":"2016-11-01T16:53:26.440Z","categories":["Slow Cooker","Pasta","Macaroni and Cheese","Cheese","Cheddar","Kid-Friendly","Dinner"],"calories":499.0,"desc":"Move over boxed mac and cheese; this version is just as simple and a whole lot tastier. The recipe is adapted from the food section of the San Diego Tribune. Pasta in the slow cooker is a bit of a challenge since there must be enough liquid to cook the pasta, but not so much that it will get mushy. We love this recipe because it is the old-fashioned mac and cheese, without a heavy white sauce to make first. The combination of the evaporated milk and egg replaces the flour as the thickener; canned milk does not curdle as fresh milk–based sauces sometimes do. Kids love the macaroni shape, so resist substituting any other shape of pasta. Please note that the pasta goes into the cooker uncooked. This recipe can be doubled and cooked in the large cooker.","protein":28.0,"rating":0.0,"ingredients":["1 1/2 cups skim or low-fat milk","1 (15-ounce) can evaporated skim milk","1 large egg, beaten","1/4 teaspoon salt","Large pinch of freshly ground black pepper","1 1/2 cups shredded medium or sharp cheddar cheese, such as Oregon Tillamook,\nVermont Colby, or Wisconsin longhorn","8 ounces elbow macaroni (about 2 cups)","2 tablespoons freshly grated or shredded Parmesan cheese"],"sodium":616.0}
{"title":"Slow Cooker Calico Beans","directions":["Combine all ingredients in a large slow cooker, and stir gently until combined. Cook on low for at least 4 hours and up to 8 hours."],"fat":20.0,"date":"2016-08-04T15:12:55.581Z","categories":["Slow Cooker","Side","Bean","Bacon","Ground Beef","Dinner","Backyard BBQ"],"calories":522.0,"desc":"Calico beans are a satisfying cross between chili, baked beans, and a sloppy joe filling. Full of a homemade barbecue-style sauce, these calico beans are meaty, tangy, salty, and deliciously perfect for any barbecue, picnic, or potluck you are heading to!","protein":29.0,"rating":0.0,"ingredients":["1 pound ground beef, browned and drained","1 pound bacon, cooked and crumbled","1 large onion, chopped","1/2 cup ketchup","1/3 cup firmly packed brown sugar","1 tablespoon apple cider vinegar","1 tablespoon Worcestershire sauce","1 teaspoon yellow mustard","1 teaspoon salt","1/2 teaspoon crushed red pepper flakes","1 (15-ounce) can tomato sauce","6 cups cooked mixed beans (if you like to use dried); or 2 (15-ounce) cans white beans, drained, plus 1 (15-ounce) can kidney beans, drained"],"sodium":660.0}
{"title":"Chicken Paprikash with Sour Cream","directions":["In slow cooker, stir together onions, 1/2 teaspoon salt, and paprika. Spread mixture evenly over bottom of insert.","Rub garlic halves over chicken, then sprinkle chicken with pepper and remaining 1/2 teaspoon salt. In medium saucepan over moderately high heat, heat butter and oil until hot but not smoking. Add chicken pieces and brown, turning occasionally, until golden, about 6 minutes. Transfer to slow cooker (do not clean pan), layering chicken on top of onion mixture.","In same saucepan over high heat, bring stock to simmer, scraping up browned bits from bottom of pan. Pour over chicken in slow cooker, cover, and cook on low until chicken is tender but not falling off bone, 5 to 6 hours.","Stir sour cream into sauce. Garnish with dill and serve."],"fat":61.0,"date":"2007-01-26T17:46:50.000Z","categories":["Slow Cooker","Chicken","Dairy","Garlic","Herb","Onion","Kid-Friendly","Back to School","Dinner","Family Reunion","Sour Cream","Sugar Conscious","Wheat/Gluten-Free","Peanut Free","Tree Nut Free","Soy Free","No Sugar Added"],"calories":827.0,"desc":"Slow-cooking dark leg meat results in incredibly tender, flavorful chicken. However, if you prefer white meat you can substitute bone-in chicken breasts. Placing the onions on the bottom of the slow cooker will ensure that they become silky soft as the chicken releases its juices, creating a heady sauce.","protein":58.0,"rating":3.75,"ingredients":["2 medium onions, thinly sliced","1 teaspoon kosher salt","1 tablespoon sweet paprika","1 teaspoon hot paprika","1 garlic clove, peeled and halved","3 pounds chicken legs","1/2 teaspoon freshly ground black pepper","1 1/2 teaspoons olive oil","1 1/2 teaspoons unsalted butter","1/2 cup chicken stock or low-sodium chicken broth","1/4 cup sour cream","Fresh dill, chopped, for garnish","Slow cooker"],"sodium":817.0}
{"title":"Slow-Cooker Cuban Pulled-Pork Panini Sandwiches","directions":["Pierce the pork roast all over with a small knife. Place the pork in the bottom of a large slow cooker. In a medium bowl, combine the garlic, orange juice, lime juice, olive oil, oregano, cumin and House Seasoning. Pour the mixture over the pork and rub it into the meat, turning to evenly coat it. Cover the slow cooker and cook on low for 8 to 10 hours, or on high for 4 to 6 hours, until the pork is extremely tender.","Transfer the pork to a cutting board. Remove and discard the fat and use 2 forks to pull the pork into chunks. Use a large spoon to skim the fat from the surface of the liquids in the slow cooker. Return the pulled pork to the slow cooker and stir well. Taste the meat and adjust the seasoning, adding salt and pepper, if desired. Cover the slow cooker and cook on high for 15 to 30 minutes, so that the pork can further absorb the flavors of the cooking liquids while you prepare the sandwich ingredients.","To assemble the sandwich, slice the loaf of bread in half horizontally. Spread a thin layer of mustard on the bottom half of the bread and then layer 1 package of the Swiss cheese, all of the pickle slices, all of the ham slices and a generous amount of pulled pork. Top the pork with the remaining 1 package of Swiss cheese and place the other half of the bread loaf on top of the Swiss cheese.","Use a serrated knife to cut the loaf into approximately 6-inch (15-cm) lengths. Brush both sides of each sandwich with the melted butter and cook the sandwiches in a panini press or a hot skillet until the cheese melts and the exterior gets toasty. If you are cooking the sandwich in a hot skillet, cover the top of the sandwich with aluminum foil and place a heavy pot or cast iron skillet on top of the foil. Flip the sandwich once the bottom is toasted and toast the other side. Cut the sandwich into slices and serve hot."],"fat":65.0,"date":"2016-10-06T19:01:00.000Z","categories":["Slow Cooker","Sandwich","Florida","Pork","Ham","Swiss Cheese","Pickles"],"calories":942.0,"desc":"Cuban pulled pork—or lechon asado—meets traditional Cuban ham and Swiss sandwiches in these zesty, melty paninis. The pork absorbs loads of flavor while slow cooking in a garlic- and citrus-infused mojo sauce, which ultimately makes for one amazing hot sandwich. Unless you live in south Florida, Cuban bread will probably be rather difficult to come by. So use whatever type of bread tickles your fancy, and if you can’t find a loaf that measures 2 feet (61 cm) long, two smaller loaves (about 12 ounces [340 g] each) of Italian or French bread, or even individual hoagie rolls, would work beautifully instead. Just make sure to start and end your sandwich layers with Swiss, since the cheese is what ends up holding together an otherwise messy panini.","protein":68.0,"rating":5.0,"ingredients":["3 lb (1.6 kg) boneless pork butt roast, trimmed","10 cloves garlic, minced","1/2 cup (120 ml) freshly squeezed orange juice","1/4 cup (60 ml) freshly squeezed lime juice","2 tablespoons (30 ml) extra-virgin olive oil","1 tablespoon (3 g) dried oregano","2 teaspoons (5 g) ground cumin","1/2 tablespoon (18 g) House Seasoning (see Cooks\u0027 Note)","Salt and freshly ground black pepper, to taste","1 (2-foot [61-cm] long) Cuban bread loaf, submarine sandwich roll, Italian bread loaf or French bread loaf","Prepared yellow mustard, as needed","2 (8-oz [227-g]) packages sliced Swiss cheese, divided","2 cups (286 g) sliced dill pickles","1 (8-oz [227-g]) package thinly sliced ham","4 tablespoons (60 ml) melted butter"],"sodium":1449.0}
{"title":"Borracho Beans","directions":["Sort the beans to remove any stones or grit. Rinse the beans in a colander and place in a large pan with the water and beer. Add the garlic, onion, epazote (if using), chile powder, cumin, pork or bacon, tomatoes, and salt.","Boil the beans for an hour and then reduce to a simmer and cook over very low heat until soft (12 hours in crockpot or other slow cooker works best). Keep the level of the broth a good inch or so above the beans, and add more water as needed. Serve with broth in a bowl as a side dish."],"fat":6.0,"date":"2004-08-20T04:00:00.000Z","categories":["Beer","Bean","Tomato","Side","Super Bowl","Bacon","Spice","Boil","Sugar Conscious","Dairy Free","Peanut Free","Tree Nut Free","Soy Free","No Sugar Added"],"calories":259.0,"desc":"Borracho means drunk, and it refers to the beer in the cooking liquid. If you\u0027re cooking beans and pork roast at the same time, you can use the fatty pieces of pork that you remove while carving to add flavor to the beans. Otherwise, use some bacon.","protein":13.0,"rating":3.125,"ingredients":["2 cups dried pinto beans","4 cups water","1 can beer","1 clove garlic, minced","1/2 onion, finely chopped","3 sprigs epazote (optional)","1 tablespoon guajillo chile powder (ground chiles)","1/2 teaspoon ground cumin","1 cup finely chopped fatty pork scraps or bacon","One 15-ounce can of tomatoes, chopped","1 teaspoon salt, or more to taste"],"sodium":458.0}
{"title":"Provençal Chicken Stew","directions":["Combine the 3/4 cup flour and the salt in a resealable plastic bag. Add the chicken to the bag, several pieces at a time, and shake to coat completely.","Heat a large sauté pan over medium-high heat and add the oil. Add the chicken and cook, turning once, for 8 to 10 minutes, until browned on both sides. Using tongs, transfer to paper towels to drain, then arrange in the slow cooker.","Set the sauté pan over medium-high heat and add the onion and the 2 tablespoons flour. Sauté, stirring frequently, for 10 minutes, or until lightly browned. Add the garlic and stir for 2 to 3 minutes. Add the wine and stir to scrape up the browned bits from the bottom of the pan. Increase the heat to high and add the tomatoes and pepper to taste. Cook, stirring frequently, for 10 to 15 minutes, until some of the tomato liquid evaporates.","Pour the onion mixture over the chicken in the slow cooker. Cover and cook on low for 3 to 8 hours, until the chicken is tender. At 3 to 4 hours, the chicken will still be firm and hold its shape. At 6 to 8 hours, the meat will be falling off the bone.","Divide the chicken among dinner plates and garnish with the parsley, basil, and olives. Serve immediately."],"fat":49.0,"date":"2007-01-26T18:02:14.000Z","categories":["Soup/Stew","Slow Cooker","Olive","Tomato","Sauté","Stew","Back to School","Winter","Potluck"],"calories":775.0,"desc":"Editor\u0027s note: The recipe and introductory text below are from The Gourmet Slow Cooker: Simple and Sophisticated Meals from Around the World by Lynn Alley. For more on slow cooking, click here.","protein":48.0,"rating":3.75,"ingredients":["3/4 cup plus 2 tablespoons all-purpose flour","1 teaspoon salt","1 chicken, cut into serving pieces and skinned","1/4 cup olive oil","1 yellow onion, finely chopped","1 clove garlic, minced","1/2 cup dry white wine","1 (14 1/2-ounce) can crushed tomatoes","Freshly ground black pepper","1/4 cup chopped fresh parsley, for garnish","1/4 cup fresh basil leaves, cut into chiffonade, for garnish","1 cup black Nyons or kalamata olives, for garnish"],"sodium":937.0}
{"title":"Flemish Beef Stew","directions":["Cook bacon in heavy large pot over medium heat until crisp, about 5 minutes. Using slotted spoon, transfer bacon to paper towels to drain. Reserve bacon drippings in pot.","Sprinkle beef with salt and pepper. Place flour in large bowl. Toss meat in flour, shaking off excess and reserving remaining flour in bowl. Heat drippings in pot over medium-high heat. Working in 2 batches, add beef to pot and cook until just browned, stirring frequently, about 5 minutes per batch. Transfer meat to large bowl.","Add onion and garlic to pot and sauté until tender, about 5 minutes. Add remaining flour and stir 1 minute. Mix in broth, beer, tomato paste, 2 tablespoons thyme, and sugar. Reduce heat to medium; simmer until mixture thickens slightly, scraping up browned bits, about 15 minutes. Add beef, 1 tablespoon thyme, and 3 tablespoons parsley. Simmer until beef is cooked as desired, about 5 minutes for medium-rare. Season with salt and pepper. Transfer stew to bowls, sprinkle with 1 tablespoon parsley and reserved bacon bits, and serve."],"fat":64.0,"date":"2004-08-20T04:00:00.000Z","categories":["Beer","Beef","Sauté","Stew","Beef Tenderloin","Bacon","Winter","Bon Appétit"],"calories":942.0,"desc":"Serve with: Buttered noodles and steamed Swiss chard. Dessert: A bakery Linzertorte.","protein":62.0,"rating":3.75,"ingredients":["6 bacon slices, coarsely chopped","2 1/4 pounds beef tenderloin, trimmed, cut into 1 1/2-inch pieces","1/3 cup all purpose flour","1 very large onion, sliced","3 large garlic cloves, minced","4 cups canned beef broth","1 cup beer","1/4 cup tomato paste","3 tablespoons chopped fresh thyme","2 tablespoons dark brown sugar","4 tablespoons chopped fresh parsley"],"sodium":1446.0}
{"title":"Curried Chicken-Coconut Soup","directions":["Combine first 6 ingredients in 6- to 8-quart pressure cooker. Remove skin from chicken; add chicken to cooker. Lock lid in place. Bring to high pressure over high heat. Cook 8 minutes, adjusting heat as necessary to maintain high pressure. Remove from heat. Let pressure come down naturally 8 minutes. Quick-release any remaining pressure.","Slowly release lid, standing back and allowing steam to escape. Transfer chicken to work surface; cool briefly. Remove bones. Cut chicken into 1/2-inch cubes. Return chicken to soup; add spinach. Simmer until spinach wilts, about 1 minute. Add lime juice. Season soup to taste with salt and pepper. Ladle soup into bowls; sprinkle with cilantro. Serve, passing lime wedges separately.","*Available at Asian markets and in the produce section of some supermarkets."],"fat":51.0,"date":"2004-08-20T04:00:00.000Z","categories":["Soup/Stew","Pressure Cooker","Chicken","Poultry","Low Carb","Quick \u0026 Easy","Lunch","Coconut","Curry","Spinach","Lemongrass","Cilantro","Bon Appétit","Sugar Conscious","Paleo","Dairy Free","Wheat/Gluten-Free","Peanut Free","Tree Nut Free","Soy Free","No Sugar Added","Kosher"],"calories":633.0,"desc":"","protein":36.0,"rating":4.375,"ingredients":["3 cups low-salt chicken broth","1 13.5-ounce can unsweetened coconut milk","3/4 cup chopped green onions","2 1/2 tablespoons curry powder","1 1/2 tablespoons minced fresh lemongrass* (from about 4 stalks)","1 tablespoon minced peeled fresh ginger","4 large chicken thighs with bones (about 1 1/2 pounds)","1 6-ounce package baby spinach leaves","3 tablespoons fresh lime juice","1/4 cup chopped fresh cilantro","Lime wedges","Special equipment: pressure cooker"],"sodium":247.0}
{"title":"Country-Style Pork Ribs With Bourbon and Coke BBQ Sauce","directions":["Trim any excess fat from the ribs and cut into approximately 5-inch-long pieces. Lightly season the ribs with salt and pepper.","Heat a large sauté pan on the stovetop over medium-high heat. Add the oil, then the ribs, and brown well on all sides. (To avoid overcrowding the pan, you may have to do this in batches.)","While the ribs are searing, spray the inside of the slow cooker with cooking spray. Add the ketchup, cola, tomato paste, garlic, brown sugar, chili sauce, bourbon, cider vinegar, sorghum syrup, Worcestershire sauce, chili powder, and cayenne. Stir well. Add the ribs to the slow cooker, layering the larger, fattier ribs on the bottom. Make sure all the ribs are covered in sauce. Cover and cook on low for at least 8 hours and up to 9 hours, until the meat is fall-off-the-bone tender.","Transfer the ribs to a platter and keep warm. Pour the leftover sauce into a small saucepan and cook over medium heat for 10 to 15 minutes, until it is reduced and slightly thickened. Skim off any visible fat, season with salt and pepper, and serve the sauce over the ribs."],"fat":103.0,"date":"2016-08-03T20:43:56.490Z","categories":["Pork Rib","Pork","Grill/Barbecue","Slow Cooker"],"calories":1364.0,"desc":"Country-style ribs are not actually ribs. This cut of meat comes from the shoulder of the pig, where it is sliced in\nhalf under the blade bone and then cut into long strips to resemble ribs. As a result, much like other tough cuts of\nmeat, country-style ribs benefit from any type of low and slow cooking. Tender, tangy, and accented with just a hint\nof bourbon, these ribs are a messy, saucy affair. Bone-in country-style ribs are recommended for this recipe since it’s\nthe bones that are packed with the most flavor (you can use boneless ribs, but they may require less cooking time).","protein":75.0,"rating":3.75,"ingredients":["4 to 5 pounds bone-in pork country-style ribs","Kosher salt and freshly ground black pepper","1 tablespoon vegetable oil","1 1/2 cups ketchup","1/2 cup cola (not diet)","3 tablespoons tomato paste","2 cloves garlic, minced","2 tablespoons brown sugar","2 tablespoons American spicy ketchup-based sauce (such as Heinz brand chili sauce) or homemade chili sauce","2 tablespoons good-quality bourbon","2 tablespoons cider vinegar","1 tablespoon sorghum syrup or light molasses","1 teaspoon Worcestershire sauce","1 teaspoon chili powder","1/4 teaspoon cayenne pepper"],"sodium":894.0}
{"title":"Quinoa Brown Rice Sushi","directions":["1. Place the rice, quinoa, and 3 cups water into a rice cooker and cook according to the manufacturer\u0027s instructions. (You can also cook the rice and quinoa in 3 cups water in a pressure cooker for 15 minutes).","2. Bring a saucepan of water to a boil and cook the carrots until softened, about 30 seconds. Drain and rinse them under cold water.","3. Unroll a bamboo sushi mat on a work surface and put a sheet of nori on it. Wet your hands and divide the rice into 4 equal portions. Divide one portion into 4 small, firm balls and press them evenly onto the nori, covering the entire sheet with a thin layer of grains. Evenly spread one-quarter of the bean curd, one quarter of the carrots, one-quarter of the cucumbers, and one quarter of the avocado in the center of the rice. Using the mat as a guide, roll the topped nori tightly and evenly into a sushi roll, wetting the edges of the nori sheet with water if necessary, so it sticks together at the seam. Repeat three more times with the remaining nori, rice, and vegetables.","4. Slice the rolls into 1 1/2-inch-thick pieces with a sharp, wet knife and transfer them to a serving platter. Garnish with cilantro and pickled ginger."],"fat":20.0,"date":"2013-03-19T04:00:00.000Z","categories":["Soy","Vegetable","Vegetarian","Dinner","Quinoa","Tofu","Avocado","Root Vegetable","Carrot","Healthy","Vegan","Brown Rice","Advance Prep Required","Pescatarian","Dairy Free","Wheat/Gluten-Free","Peanut Free","Tree Nut Free","No Sugar Added","Kosher"],"calories":507.0,"desc":"Benefits: Heart + Metabolism","protein":15.0,"rating":0.0,"ingredients":["1 cup sticky brown rice","1/2 cup quinoa","8 ounces baked bean curd/tofu, cut into long thin strips","4 to 5 carrots cut into matchsticks","4 nori seaweed sheets","2 pickled cucumbers (low sodium), cut into matchsticks","2 avocados, peeled, pitted, and sliced","Cilantro sprigs, for garnish","Pickled ginger, for garnish"],"sodium":77.0}
{"title":"Custard Sauce","directions":["Bring milk just to a boil in a 3-quart heavy saucepan and remove from heat. Whisk together yolks, sugar, and a pinch of salt in a bowl and add hot milk in a slow stream, whisking. Pour custard into pan and cook over moderately low heat, stirring constantly, until slightly thickened and a thermometer registers 170°F. Pour through a fine sieve into a pitcher and serve warm."],"fat":10.0,"date":"2004-08-20T04:00:00.000Z","categories":["Sauce","Dairy","Egg","Gourmet"],"calories":202.0,"desc":"Active time: 20 min Start to finish: 20 min","protein":7.0,"rating":4.375,"ingredients":["1 1/2 cups whole milk","6 large egg yolks","1/3 cup sugar"],"sodium":52.0}
{"title":"Ginger Cardamom Oeufs à la Neige","directions":["Line bottom of a small 4-sided sheet pan with parchment paper.","Separate 2 eggs; put yolks in a large bowl and whites in another. Add whole egg to yolks.","Beat whites with a pinch of salt using an electric mixer until they hold soft peaks. Add 1/2 cup sugar in a slow stream, beating at medium-high speed until whites hold stiff, glossy peaks.","Meanwhile, bring milk to a bare simmer with ginger and cardamom in a wide 4-quart heavy pot over medium heat.","Drop 4 large dollops of beaten whites into milk and poach at a bare simmer, turning once, 4 minutes. Transfer with a slotted spoon to lined pan (reserve milk).","Whisk remaining 3 tablespoons sugar, cornstarch, and salt into yolk mixture. Add hot milk in a slow stream, whisking until incorporated, then return to pot. Cook, stirring often, until thickened and an instant-read thermometer registers 170°F. Strain through a fine-mesh sieve into a clean bowl. Stir in vanilla.","Quick-chill custard by setting bowl in an ice bath and stirring occasionally, about 20 minutes. Ladle into 4 bowls and put a meringue in each. Sprinkle with nuts."],"fat":11.0,"date":"2008-10-07T14:08:20.000Z","categories":["Milk/Cream","Egg","Ginger","Dessert","Poach","Pistachio","Spice","Chill","Gourmet","Vegetarian","Pescatarian","Wheat/Gluten-Free","Peanut Free","Soy Free","Kosher"],"calories":308.0,"desc":"Inspired by a dessert served at Le Bistro Paul Bert, in Paris, we used Indian spices to restyle this elegant classic custard. It takes its French name (\"eggs in the snow\") from the lightly poached dollops of meringue that top it.","protein":10.0,"rating":4.375,"ingredients":["3 large eggs","1/2 cup plus 3 tablespoons sugar, divided","2 cups whole milk","1/2 teaspoon ground ginger","1/4 teaspoon ground cardamom","1/2 teaspoon cornstarch","1/8 teaspoon salt","1/2 teaspoon pure vanilla extract","1/4 cup roasted shelled pistachios, chopped"],"sodium":179.0}
{"title":"Porcini Mushroom Risotto","directions":["Bring 2 cups water to boil in heavy small saucepan. Add mushrooms. Cover; let stand until mushrooms soften, about 10 minutes. Using slotted spoon, transfer mushrooms to work surface; reserve soaking liquid. Chop mushrooms coarsely.","Melt butter with oil in pressure cooker over medium-high heat. Add rice, shallots, and fennel seeds; stir 1 minute. Add wine and cook until almost evaporated, stirring frequently, about 1 minute. Mix in 2 cups broth and salt, then mushrooms and reserved mushroom soaking liquid, leaving any sediment behind in pan. Lock lid in place. Bring to high pressure over high heat. Cook rice 4 minutes, adjusting heat as necessary to maintain high pressure. Quick-release pressure.","Slowly release lid, standing back and allowing steam to escape. Cook rice over medium-high heat until creamy and tender but still firm to bite, stirring often and adding more broth by 1/4 cupfuls if thinner consistency is desired, about 2 minutes. Mix in cheese and parsley. Season risotto to taste with pepper.","*Dried porcini mushrooms are available at Italian markets, specialty foods stores, and many supermarkets."],"fat":10.0,"date":"2004-08-20T04:00:00.000Z","categories":["Mushroom","Rice","Appetizer","Side","Vegetarian","Parmesan","White Wine","Fall","Simmer","Bon Appétit","Pescatarian","Wheat/Gluten-Free","Peanut Free","Tree Nut Free","Soy Free","Kosher"],"calories":353.0,"desc":"","protein":13.0,"rating":4.375,"ingredients":["2 cups water","1 ounce dried porcini mushrooms*","1 tablespoon butter","1 tablespoon olive oil","1 1/2 cups arborio rice or medium-grain white rice (about 9 1/2 ounces)","3 large shallots, chopped","1 teaspoon fennel seeds","1/2 cup dry white wine","2 cups (or more) low-salt chicken broth","1/2 teaspoon salt","1 cup freshly grated Parmesan cheese (about 3 ounces)","2 tablespoons chopped fresh parsley","Special equipment: pressure cooker"],"sodium":488.0}
{"title":"All-Day Slow-Cooker Cassoulet","directions":["Put the beans in a medium bowl, cover with about 3 inches of water, and soak overnight. Or put the beans in a saucepan, cover with water, and bring to a boil for 3 minutes. Remove from the heat and soak for 1 hour. Then drain.","Meanwhile, cut the duck into 8 pieces: 2 breast halves, 2 drumsticks, 2 thighs, and 2 wings. Trim off all visible fat and excess skin and set the fat and skin aside. Season the duck pieces and lamb with the salt and pepper and set aside.","Cook the duck fat and skin in a large heavy skillet over medium heat until between 1/4 and 1/3 cup fat is in the pan, about 4 minutes. Remove the solid pieces of fat and skin and discard. Brown the duck in the hot fat on both sides, about 4 minutes per side, and set aside. Brown the lamb, about 4 minutes per side, and set aside. Brown the sausage pieces on all sides, about 3 minutes per side, and set aside.","Add the onion and celery to the skillet and sauté until lightly browned, about 4 minutes. Add the garlic, nutmeg, Italian seasoning, and cloves and sauté until aromatic, about 1 minute. Add the wine and bring to a boil. Add the beef broth and tomatoes, return to a boil, and remove from the heat.","Layer the beans and meats, in alternating layers (4 of beans, 3 of meat), starting and ending with the beans. Pour the liquid over all, cover the cooker, and cook until the beans are tender, 8 to 10 hours on low.","Preheat an oven to 350°F. Mix the breadcrumbs and parsley and scatter over the top of the cassoulet. Transfer the crock with the cassoulet to the oven and bake until the top is browned and bubbling, about 30 minutes. Serve immediately."],"fat":77.0,"date":"2016-10-24T18:25:41.549Z","categories":["Slow Cooker","Lamb","Sausage","Duck","Bean","Breadcrumbs","Soup/Stew"],"calories":1028.0,"desc":"Last year I made this traditional French country casserole for a Super Bowl party. As a result, my sons will always think of it not as the legendary Languedoc amalgam of beans and meats that has inspired endless recipes, but as the classic Super Bowl gut-buster. They’re right. Cassoulet is peasant food, built to assuage hunger so completely that no amount of labor or hardship could dent the cloud of contentment it generates. And though foodies may argue about authenticity and the precise balance of meat to beans, and whether breadcrumbs belong on top, the truth is, a cassoulet is made from whatever you have on hand. Mine has white beans, lamb, garlic sausage, and smoked sausage (and breadcrumbs), but you can make yours with pork or ham, goat, or duck. Whatever you use, keep the proportions similar to those listed below, and you can’t lose. Go Eagles!","protein":50.0,"rating":0.0,"ingredients":["1 pound dried large white beans, such as cannellini or baby limas","1 duck (about 4 pounds)","1 pound boneless leg of lamb, cut into 2-inch cubes","2 teaspoons kosher salt","1/2 teaspoon coarsely ground black pepper","8 ounces garlic sausage, cut into 2-inch lengths","8 ounces smoked sausage, such as andouille, cut into 2-inch lengths","1 large onion, diced","2 large celery ribs, cut into 1/4-inch-thick slices","4 cloves garlic, minced","1/4 teaspoon ground nutmeg","1 teaspoon dried Italian seasoning","Pinch of ground cloves","1/2 cup dry white wine","4 cups beef or chicken broth, or a mixture","1 can (about 15 ounces) diced tomatoes, drained","2/3 cup dried breadcrumbs","1/4 cup coarsely chopped fresh Italian (flat-leaf) parsley","5–6 quart slow cooker"],"sodium":851.0}
{"title":"Slow-Cooker Oatmeal With Apples and Ginger","directions":["Mix apple, ginger, steel-cut oats, rice, old-fashioned oats, raisins (if using), almonds (if using), flaxseeds (if using), cinnamon, and salt in a slow cooker. Cover with 12 cups water and stir to combine. Cook on low until porridge is thick and soft, 7–8 hours.","Porridge can be made 1 week ahead; transfer to an airtight container and chill. To serve, scoop out desired amount and add a splash of water or milk. Heat in a pot over medium or microwave on high in a heatproof bowl until heated through and desired texture is reached, adding more liquid if needed."],"fat":3.0,"date":"2016-10-26T01:36:35.510Z","categories":["Slow Cooker","Breakfast","Oat","Oatmeal","Grains","Ginger","Raisin","Almond","Apple"],"calories":212.0,"desc":"This warming porridge features oats two ways plus brown rice, millet, or quinoa. Knowing you have a bubbling hot breakfast waiting for you on a chilly morning makes getting out of bed so much easier. This recipe feeds a crowd, but it also reheats easily for individual servings throughout the week.","protein":6.0,"rating":2.5,"ingredients":["1 apple, cut into 1/2\" pieces","1 (2\") piece fresh ginger, finely chopped","2 cups steel-cut oats","1 cup short-grain brown rice, millet, or quinoa","1/2 cup golden raisins (optional)","1/2 cup rolled old-fashioned oats","1/2 cup slivered almonds (optional)","2 tablespoons flaxseeds (optional)","1 teaspoon ground cinnamon","1 teaspoon kosher salt"],"sodium":241.0}
{"title":"Potato, Cheddar, and Chive Soup","directions":["Place the potatoes and 1 cup of the stock in the slow cooker. Cover and cook on high for 2 hours, or until the potatoes are just tender.","Transfer two-thirds of the potatoes to a food processor or blender, along with the cooking liquid. Add the garlic. Blend to the desired consistency: a blender will yield a smooth texture, a food processor a rough, rustic consistency.","Return the potato purée to the slow cooker and stir in the shredded cheese, the remaining 2/3 cup stock, and the chives. Cover and cook on low for 30 minutes, or until the soup is well heated. Add extra stock or water if the soup is too thick. Break up the whole potato slices with a fork to achieve a texture that suits you. Season with salt and pepper. Stir in the cream just before serving.","Ladle into soup bowls, sprinkle with the crumbled cheese, and serve immediately.","For a Southwestern version of this soup, use cilantro instead of chives, and add 1 (4-ounce) can chopped roasted green chiles and 1 teaspoon each ground cumin and coriander."],"fat":13.0,"date":"2007-01-26T18:04:11.000Z","categories":["Blender","Food Processor","Slow Cooker","Chicken","Garlic","Herb","Potato","Kid-Friendly","Back to School","Cheddar","Winter","Chive"],"calories":488.0,"desc":"Editor\u0027s note: The recipe and introductory text below are from The Gourmet Slow Cooker: Simple and Sophisticated Meals from Around the World by Lynn Alley. For more on slow cooking, click here.","protein":20.0,"rating":3.125,"ingredients":["4 large potatoes, peeled and sliced","4 cups chicken stock, plus more as needed","1 large clove garlic","1 cup shredded sharp Cheddar cheese, or a mixture of sharp Cheddar and smoked Gouda","1/4 cup chopped fresh chives","Salt and freshly ground black pepper","1 cup heavy cream, half-and-half, or sour cream (optional)","1/4 cup crumbled sharp Cheddar cheese, for garnish"],"sodium":1129.0}
{"title":"Trail Mix Porridge","directions":["Stir all the ingredients in a slow cooker until the maple syrup has dissolved and all the grains are moistened. Cover and cook on low for 6 hours, or until the porridge is creamy and the grains are tender."],"fat":2.0,"date":"2014-01-30T04:00:00.000Z","categories":["Slow Cooker","Breakfast","Brunch","Cranberry","Walnut","Barley","Maple Syrup","Bulgur","Hominy/Cornmeal/Masa","Kidney Friendly","Vegan","Vegetarian","Pescatarian","Dairy Free","Peanut Free","Soy Free","Kosher"],"calories":242.0,"desc":"EFFORT: NOT MUCH\nPREP TIME: 15 MINUTES\nCOOK TIME: 6 HOURS\nKEEPS ON WARM: 1 HOUR","protein":4.0,"rating":3.75,"ingredients":["6 cups water","1 1/2 cups chopped fresh cranberries","3/4 cup pearled barley","3/4 cup packed light brown sugar","1/2 cup walnut pieces, toasted and coarsely ground","6 tablespoons medium-ground bulgur (or #2)","6 tablespoons corn (or hominy) grits","6 tablespoons millet","6 tablespoons maple syrup","1/2 teaspoon ground cinnamon","1/4 teaspoon salt"],"sodium":90.0}
{"title":"Ratatouille Sandwich","directions":["Use a 6-quart slow cooker. Put the eggplant, onion, bell peppers, zucchini, squash, and tomatoes into the insert. Add the pasta sauce, oil, salt, and black pepper, and stir well to combine. Cover, and cook on low for 8 hours, or until the vegetables have broken down quite a bit and the onion is translucent. Serve on the buns with a slice of cheese on top, if desired."],"fat":2.0,"date":"2015-05-26T04:00:00.000Z","categories":["Onion","Tomato","Low Fat","Vegetarian","Kid-Friendly","Dinner","Lunch","Eggplant","Bell Pepper","Squash","Spring","Summer","Healthy","Swiss Cheese","Pescatarian","Peanut Free","Tree Nut Free","Soy Free","Kosher"],"calories":89.0,"desc":"Everything about these sandwiches screams \"backyard summer party\" to me. Simmering vegetables all day really brings out the individual flavors, and I love how I can get so many good-for-you vitamins into such a delicious package.","protein":3.0,"rating":0.0,"ingredients":["1 eggplant, peeled, quartered, and sliced","1 red onion, sliced into thin rings","1 red bell pepper, seeded and thinly sliced","1 orange bell pepper, seeded and thinly sliced","1 medium zucchini, thinly sliced","2 small yellow summer squash, thinly sliced","3 ripe tomatoes, quartered","1/4 cup prepared pasta sauce","1 tablespoon olive oil","1/2 teaspoon kosher salt","1/4 teaspoon ground black pepper","8 soft sandwich buns, toasted","8 ounces Swiss or provolone cheese, sliced (optional)"],"sodium":164.0}
{"title":"Hot and Sour Shrimp Soup (Tom Yum Kung)","directions":["In the slow cooker, stir together the chicken stock, lemongrass, lime rind, Tom Yum paste, mushrooms, and Thai chiles.","Cook on low for 6 hours, or on high for 2 hours.","Adjust the heat to high, and add the shrimp, fish sauce, lime juice, and palm sugar, and cook for 10 minutes more, or until the shrimp are uniformly pink.","Ladle the soup into a tureen or individual bowls, garnish with the cilantro, and serve."],"fat":6.0,"date":"2016-01-30T22:09:00.000Z","categories":["Slow Cooker","Shrimp","Chile","Lemongrass","Soup/Stew","Mushroom","Shellfish","Lime Juice","Dinner"],"calories":290.0,"desc":"Tom Yum is made so many different ways that no two batches are really ever alike. Simultaneously spicy, tart, and sweet, this soup grows on you the more you eat it. Try it along with rice to cut some of the heat, or eat it throughout a meal for a welcome contrast.","protein":27.0,"rating":0.0,"ingredients":["6 cups chicken stock","1 stalk lemongrass, trimmed and cut into thin slices","Rind of 1 key lime","2 tablespoons store-bought Tom Yum paste (Thai chile-tamarind paste)","1 cup quartered button mushrooms","3 to 5 Thai chiles, thinly sliced","1 pound medium shrimp","1/4 cup fish sauce","1/2 cup freshly squeezed lime juice","1/4 cup palm sugar","Cilantro, for garnish"],"sodium":2556.0}
{"title":"Glazed Pork Loin with Cilantro and Garlic","directions":["1. Place the pepper flakes in a small bowl and pour the boiling water over them. Let sit for 1 to 2 minutes to rehydrate the flakes. Combine all the brine ingredients in a blender, or in a large bowl using an immersion/stick blender. Stir in the pepper flakes and the soaking water.","Place the loin in an extra-large resealable plastic bag, pour the brine over the top, squeeze out any excess air from the bag, and close. Roll the bag to evenly coat the meat. Refrigerate for at least 6 hours, or up to 12.","2. Preheat an indirect barbecue with a drip pan and fruitwood (preferably apple), a ceramic cooker with deflector plate and fruitwood (preferably apple), or a charcoal or gas grill with a box or packet of fruitwood (preferably apple) to 250°F.","3. Combine all of the seasoning blend ingredients.","Place all of the glaze ingredients in a jar with a tight-fitting lid and shake to combine. Set aside.","4. Remove the loin from the brine and lightly pat dry with paper towels.","Sprinkle the rub evenly on all sides.","Using your hands or a brush, evenly, but lightly, coat the loin with canola oil.","Insert a remove thermometer into the center of the meat.","5. Place the loin in the cooker and cook until the internal temperature reaches 135°F, about 1 hour and 15 minutes.","6. Give the glaze a quick shake to reincorporate any ingredients that may have settled. Brush the loin with the glaze and return to the cooker until the internal temperature reaches 145°F, about 15 minutes. At this point the meat will be slightly pink in the center; cook for an additional 5 to 10 minutes for more well-done.","7. Pour about half of the remaining glaze on a cutting board and top with the loin. Let rest for 10 minutes.","8. Slice the meat into 1/4-inch slices. Dredge the slices in the glaze, adding additional as needed to coat the exposed sides. Sprinkle with fleur de sel and pepper."],"fat":42.0,"date":"2009-05-14T04:00:00.000Z","categories":["Garlic","Herb","Pork","Vegetable","Marinate","Fourth of July","Super Bowl","Father\u0027s Day","Backyard BBQ","Dinner","Lunch","Meat","Tailgating","Family Reunion","Grill","Grill/Barbecue","Party","Cilantro","Dairy Free","Wheat/Gluten-Free","Peanut Free","Tree Nut Free","Soy Free"],"calories":754.0,"desc":"When I was little, I would beg my mom to make pork chops, because she\u0027d top them with this sweet, sticky condiment called Saucy Susan. It\u0027s a sort of jam made from apricots, and ever since she first combined the two ingredients, I\u0027ve been obsessed with how well the fruit goes with pork. Nowadays, I pay homage to the sweet-tart flavor of the fruit by brining the loin in apricot nectar and later building upon the flavors with a glaze made from apricot preserves and lemon.","protein":61.0,"rating":5.0,"ingredients":["1 teaspoon crushed hot red pepper flakes","1 tablespoon boiling water","2 cups apricot nectar","2 cups water","1/2 cup kosher salt","1/2 cup granulated sugar","10 garlic cloves, peeled, halved, germ removed, and grated on a Microplane grater","One 6 1/2- to 7-pound pork loin","2 tablespoons mild chile powder, preferably Chimayo, Ancho, or Hatch","1 tablespoon sweet paprika","1 tablespoon firmly packed dark brown sugar","3/4 teaspoon dry mustard","1/2 teaspoon garlic salt","1/2 teaspoon lemon pepper","1/2 teaspoon coarsely ground fresh black pepper","1/2 teaspoon kosher salt","1/4 teaspoon Old Bay Seasoning","1/4 teaspoon ground cumin","1/2 cup apricot preserves","1 1/2 tablespoons freshly squeezed lemon juice","3 tablespoons finely chopped cilantro or flat-leaf parsley","1 garlic clove, peeled, halved, germ removed, and grated on a Microplane grater","About 2 tablespoons canola or vegetable oil","Fleur de sel","Finely ground fresh black pepper"],"sodium":4822.0}
{"title":"Roasted Red-Pepper and Hazelnut Dip","directions":["Purée all ingredients, except oil, with 1/2 teaspoon salt and 1/4 teaspoon pepper in a food processor until almost smooth, then add oil in a slow stream with motor running."],"fat":6.0,"date":"2007-09-17T22:18:47.000Z","categories":["Condiment/Spread","Food Processor","Nut","Pepper","Vegetable","No-Cook","Vegetarian","Quick \u0026 Easy","Tree Nut","Walnut","Bell Pepper","Healthy","Hazelnut","Gourmet"],"calories":203.0,"desc":"","protein":6.0,"rating":4.375,"ingredients":["1 (7- to 8-ounce) jar roasted red peppers, rinsed and drained","1 cup coarse fresh bread crumbs (preferably from a baguette)","1 small garlic clove","1/4 teaspoon cumin","1/4 cup hazelnut or walnut oil"],"sodium":265.0}
{"title":"Cardamom and Lemon Rice Pudding","directions":["In slow cooker, whisk together milk, cream, eggs, granulated and brown sugars, vanilla, zest, cardamom pods, and nutmeg. Stir in rice, cover and cook on high 1 hour, stirring occasionally. Reduce heat to low, add raisins, and cook 1 hour more, stirring occasionally. Serve warm, or refrigerate and serve chilled."],"fat":23.0,"date":"2007-01-26T17:55:48.000Z","categories":["Slow Cooker","Citrus","Dairy","Egg","Fruit","Rice","Dessert","Kid-Friendly","Back to School","Winter","Vegetarian","Pescatarian","Wheat/Gluten-Free","Peanut Free","Tree Nut Free","Soy Free","Kosher"],"calories":821.0,"desc":"This wintertime favorite, a great way to use up the leftover rice in your fridge, gets a surprise lift from lemon zest. For added crunch, sprinkle it with slivered almonds or pistachios before serving.","protein":16.0,"rating":4.375,"ingredients":["3 cups whole milk","1 cup heavy cream","4 large eggs, beaten","1/2 cup granulated sugar","1/2 cup packed light brown sugar","1 teaspoon vanilla extract","2 teaspoons finely grated lemon zest (from 1 medium lemon)","5 whole green cardamom pods","1/4 teaspoon freshly grated nutmeg","3 cups cooked medium-grain white rice","1 cup golden raisins","Special equipment: Slow cooker"],"sodium":124.0}
{"title":"Chick-Pea, Garlic, and Parsley Dip","directions":["In a food processor blend all ingredients except oil until smooth. With motor running add oil in a slow stream. Season dip with salt. Serve dip with toasts."],"fat":18.0,"date":"2004-08-20T04:00:00.000Z","categories":["Condiment/Spread","Food Processor","Garlic","Appetizer","No-Cook","Vegetarian","Quick \u0026 Easy","Low Cal","Lemon","Chickpea","Healthy","Vegan","Gourmet"],"calories":344.0,"desc":"Can be prepared in 45 minutes or less.","protein":11.0,"rating":3.75,"ingredients":["a 19-ounce can chick-peas, rinsed and drained (about 2 cups)","2 garlic cloves, chopped and mashed to a paste with 1/2 teaspoon salt","1/2 cup packed fresh parsley leaves, washed well and spun dry","1/4 cup water","3 tablespoons fresh lemon juice","1/4 cup extra-virgin olive oil","Accompaniment: toasted pita wedges or toasted French bread slices"],"sodium":388.0}
{"title":"Beef Short Ribs with Asian Flavors","directions":["Combine onions and broth in 6- to 8-quart pressure cooker. Place ribs in large bowl. Add hoisin sauce, soy sauce, vinegar, and sesame oil; toss to coat evenly. Transfer ribs and all juices from bowl to cooker. Scatter prunes over. Lock lid in place. Bring to high pressure over high heat. Cook 35 minutes, adjusting heat as necessary to maintain high pressure. Remove from heat. Let pressure come down naturally, about 20 minutes.","Slowly release lid, standing back and allowing steam to escape. If ribs are not tender, lock on lid, return cooker to high pressure, and cook 5 minutes longer. Remove from heat. Let pressure come down naturally.","Using slotted spoon, transfer ribs a