{"title":"Ginger Marmalade Chicken Salad","directions":["Place chicken on plate. Season with salt and pepper. Mix marmalade, ginger, garlic and mustard in bowl. Spoon 1/4 cup marmalade mixture over chicken and turn to coat. Chill chicken and remaining marmalade mixture separately overnight.","Preheat broiler. Arrange chicken on broiler pan. Broil until chicken is cooked through, about 5 minutes per side. Cool slightly. Spread remaining marmalade mixture over chicken. Cut chicken crosswise into thin strips.","Whisk oil, reserved liquid from peppers and vinegar in large bowl. Season with salt and pepper. Add salad greens, pepper strips and chicken; toss to coat. Top salad with onions."],"fat":10.0,"date":"2004-08-20T04:00:00.000Z","categories":["Salad","Chicken","Ginger","Leafy Green","Broil","Marinate","Chill","Bon Appétit"],"calories":451.0,"desc":"This lively salad is from Jorge Navarro, the chef-owner of Café Navarro, a cozy, Caribbean-style spot in Eugene, Oregon.","protein":56.0,"rating":4.375,"ingredients":["4 skinless boneless chicken breast halves","1/3 cup orange marmalade","2 tablespoons minced peeled fresh ginger","2 garlic clove, minced","1 teaspoon Dijon mustard","1 tablespoon olive oil (preferably extra-virgin)","1/2 cup roasted red bell peppers from jar, cut into strips, 1 tablespoon liquid reserved","5 teaspoons red wine vinegar","8 cups mixed salad greens","4 thin red onion slices, separated into rings"],"sodium":162.0}
{"title":"Southern-Style Fried Chicken","directions":["Rinse chicken and pat dry with paper towels. Place shortening in a large cast-iron skillet and heat to 350°F. Melted shortening should be 1/2 inch deep.","In a shallow bowl, whip together buttermilk and eggs. In another shallow bowl, combine flour, salt, and pepper. Dip chicken pieces in egg mixture, then dredge in seasoned flour. Carefully place about half of the chicken pieces in hot shortening. (The temperature of the shortening will drop when you add the chicken; try to maintain a temperature of 325°F.) Fry chicken until golden brown on all sides or until each piece reaches an internal temperature of 160°F, turning the chicken several times to prevent burned spots. This will take about 10 minutes for skinless breasts and 20 minutes for pieces with skin and bones. Drain cooked chicken on a rack, then keep warm in a 200°F oven while frying remaining chicken. Serve with chicken velouté."],"fat":76.0,"date":"2013-01-03T04:00:00.000Z","categories":["Chicken","Poultry","Fry","Picnic","Mardi Gras","Dinner","Lunch","Party","Sugar Conscious","Peanut Free","Tree Nut Free","Soy Free","No Sugar Added"],"calories":2484.0,"desc":"","protein":384.0,"rating":0.0,"ingredients":["4 skinless chicken breast halves (8 ounces each), or 1 whole chicken (3 to 3 1/2 pounds), cut into serving pieces","Shortening for frying","1/2 cup buttermilk","2 large eggs, beaten","1 1/2 cups flour","1 1/2 teaspoons salt","1 teaspoon black pepper","Chicken Velouté"],"sodium":1791.0}
{"title":"Indian-Style Chicken with Ginger and Curry","directions":["Mix first 6 ingredients in 8 x 8 x 2-inch glass baking dish. Add chicken; turn to coat with marinade. Cover and refrigerate at least 2 hours and up to 1 day.","Remove chicken from marinade and reserve marinade. Pat chicken dry and sprinkle with salt and pepper. Heat olive oil in heavy large skillet over medium-high heat. Add chicken to skillet and sauté until brown, about 3 minutes per side. Add reserved marinade and chicken broth and bring to boil. Reduce heat to medium-low and simmer uncovered until chicken is cooked through, turning occasionally, about 6 minutes. Transfer chicken and sauce to platter. Serve with yogurt, if desired."],"fat":14.0,"date":"2004-08-20T04:00:00.000Z","categories":["Chicken","Ginger","Sauté","Curry","Bon Appétit"],"calories":376.0,"desc":"Offer white rice alongside this simple, reduced-fat version of one of Rupa\u0027s childhood favorites.","protein":54.0,"rating":4.375,"ingredients":["1 cup chopped onion","1/4 cup bottled nonfat Italian dressing","1 tablespoon chopped peeled fresh ginger","3/4 teaspoon dried crushed red pepper","1/2 teaspoon curry powder","1/4 teaspoon ground turmeric","4 skinless boneless chicken breast halves","1 tablespoon olive oil","1/2 cup canned low-salt chicken broth","Plain nonfat yogurt (optional)"],"sodium":121.0}
{"title":"Chicken with Cranberry-Mustard Sauce","directions":["Sprinkle chicken with onion powder, thyme, salt, and pepper. Melt 2 tablespoons butter in heavy large skillet over medium-high heat. Add chicken and sauté until brown, about 5 minutes per side. Using tongs, transfer chicken to plate. Add remaining 2 tablespoons butter to same skillet and melt. Whisk in flour and mustard; cook 1 minute. Gradually whisk in broth, juice concentrate, and cranberries. Bring to boil, whisking occasionally. Boil until sauce thickens enough to coat spoon, about 6 minutes. Return chicken to skillet. Reduce heat to medium-low and simmer until chicken is cooked through, about 5 minutes. Season to taste with salt and pepper and serve."],"fat":20.0,"date":"2004-08-20T04:00:00.000Z","categories":["Chicken","Mustard","Sauté","Quick \u0026 Easy","Cranberry","Fall","Simmer","Bon Appétit","Florida"],"calories":552.0,"desc":"Doris Murphy of Pompano Beach, Florida, writes: \"When I was raising my children, the dishes I made were definitely home style to suit everyone\u0027s tastes; but even without the demands of feeding a family, I still prefer simpler recipes. Nevertheless, I notice that most of my kids are pretty adventurous cooks. Maybe they did get some of that creativity from me; when I recall the potato-meat-and-vegetable meals my mother served, I realize that I did branch out a bit.\"","protein":72.0,"rating":3.75,"ingredients":["4 large skinless boneless chicken breast halves","1 teaspoon onion powder","1 teaspoon dried thyme","4 tablespoons (1/2 stick) butter","2 tablespoons all purpose flour","1/2 teaspoon dry mustard","1 1/2 cups low-salt chicken broth","3/4 cup frozen concentrated cranberry juice cocktail, thawed","1/4 cup dried cranberries"],"sodium":168.0}
{"title":"Chicken with Spicy Tomato Sauce","directions":["Puree first 9 ingredients in blender.","Heat oil in heavy large skillet over high heat. Sprinkle chicken with salt and pepper. Add chicken to skillet; sauté until brown, about 2 minutes per side. Add sauce from blender. Reduce heat to medium. Simmer uncovered until chicken is cooked through, turning chicken over once, about 10 minutes. Using tongs, transfer chicken to work surface. Continue to simmer sauce until slightly thickened, about 5 minutes longer. Season sauce with salt and pepper.","Cut chicken crosswise into thin slices. Return to sauce and heat through."],"fat":14.0,"date":"2004-08-20T04:00:00.000Z","categories":["Blender","Chicken","Poultry","Tomato","Sauté","Winter","Healthy","Bon Appétit","Mexico"],"calories":385.0,"desc":"Serve with rice or as a burrito filling.","protein":55.0,"rating":3.75,"ingredients":["1 14 1/2-ounce can Mexican-style or regular stewed tomatoes","1/2 cup orange juice","1/2 cup canned low-salt chicken broth","2 tablespoons chili powder","2 tablespoons fresh lime juice","3 large garlic cloves, chopped","2 teaspoons dried oregano","1 tablespoon dark brown sugar","1/2 teaspoon ground cumin","3 tablespoons olive oil","6 skinless boneless chicken breast halves"],"sodium":269.0}
{"title":"Breaded Chicken Cutlets with Chunky Vegetable Sauce","directions":["Preheat oven to 400°F. Place vegetables on large rimmed baking sheet. Sprinkle with salt and pepper. Drizzle oil over; toss to coat. Roast vegetables until tender and brown around edges, turning occasionally, about 45 minutes. Remove from oven. Increase oven temperature to 500°F.","Meanwhile, spray large nonstick baking sheet with oil spray. Place breadcrumbs on sheet of waxed paper. Whisk egg whites in shallow bowl until foamy. Using mallet, pound chicken breasts to 1/3-inch thickness. Sprinkle chicken with salt and pepper. Turn chicken in breadcrumbs; place on platter. Stir Parmesan into remaining breadcrumbs on waxed paper. Dip chicken into egg whites to coat. Then dip chicken into Parmesan breadcrumbs to coat; shake off excess.","Transfer vegetables to bowl; mix in parsley and thyme. Add broth to baking sheet; scrape up any browned bits. Pour over vegetables. Keep warm.","Bake chicken on prepared sheet 5 minutes. Turn chicken over; bake just until cooked through, about 5 minutes longer. Transfer chicken to plates. Spoon vegetable sauce alongside."],"fat":14.0,"date":"2004-08-20T04:00:00.000Z","categories":["Chicken","Poultry","Tomato","Vegetable","Bake","Kid-Friendly","Back to School","Dinner","Bell Pepper","Zucchini","Winter","Healthy","Bon Appétit"],"calories":531.0,"desc":"","protein":66.0,"rating":3.75,"ingredients":["4 large plum tomatoes, quartered","1 large onion, cut into 1/2-inch-wide wedges","2 red or green bell peppers, sliced","1 8-ounce zucchini, trimmed, halved lengthwise, sliced crosswise","1 tablespoon olive oil","Nonstick vegetable oil spray","1 cup dry breadcrumbs","4 large egg whites","4 skinless boneless chicken breast halves","1/4 cup freshly grated Parmesan cheese","2 tablespoons chopped fresh Italian parsley","1 teaspoon chopped fresh thyme or 1/2 teaspoon dried","1 cup canned low-salt chicken broth, hot"],"sodium":487.0}
{"title":"Chicken with Mustard Cream on Watercress","directions":["Divide watercress between 2 plates. Place chicken between sheets of waxed paper. Using rolling pin, pound chicken to even 1/2-inch thickness. Peel off paper. Sprinkle chicken with salt and pepper.","Melt butter in heavy medium skillet over medium heat. Add chicken; sauté until cooked through, about 4 minutes per side. Place chicken atop watercress. Add broth, cream and mustard to skillet. Boil until sauce thickens, whisking often, about 2 minutes. Season with salt and pepper. Spoon sauce over chicken."],"fat":17.0,"date":"2004-08-20T04:00:00.000Z","categories":["Chicken","Leafy Green","Mustard","Poultry","Vegetable","Sauté","Quick \u0026 Easy","Summer","Watercress","Bon Appétit"],"calories":401.0,"desc":"This recipe can be prepared in 45 minutes or less.","protein":56.0,"rating":4.375,"ingredients":["1 bunch watercress, stems trimmed","2 skinless boneless chicken breast halves","1 tablespoon butter","1/3 cup canned low-salt chicken broth","1/4 cup whipping cream","2 1/2 tablespoons honey Dijon mustard"],"sodium":352.0}
{"title":"Sesame, Lemon and Curry Chicken Strips","directions":["Blend yogurt and chutney in processor. Add cilantro and process 5 seconds. Transfer sauce to small bowl. (Can be prepared 1 day ahead. Cover and chill.)","Arrange chicken in shallow dish. Pour lemon juice over. Refrigerate at least 15 minutes and up to 30 minutes, turning chicken occasionally.","Preheat oven to 400°F. Lightly grease baking sheet. Drain chicken. Combine sesame seeds and garlic in shallow bowl. Sprinkle both sides of chicken with curry powder. Season with salt and pepper. Press chicken into sesame seed mixture, coating completely. Arrange chicken on prepared sheet. Bake chicken until just cooked through, about 20 minutes. Let stand 15 minutes. Cut chicken crosswise into 1/2-inch-wide strips.","Arrange chicken strips around edge of serving platter. Place chutney dip in center and serve."],"fat":14.0,"date":"2004-08-20T04:00:00.000Z","categories":["Food Processor","Chicken","Bake","Marinate","Kid-Friendly","Yogurt","Diwali","Buffet","Curry","Healthy","Sesame","Bon Appétit","Los Angeles","California"],"calories":361.0,"desc":"An easy do-ahead appetizer.","protein":40.0,"rating":3.75,"ingredients":["1/2 cup plain low-fat yogurt","1/3 cup purchased mango chutney (such as Major Grey\u0027s)","2 tablespoons chopped fresh cilantro","4 boneless skinless chicken breast halves","1/2 cup fresh lemon juice","3/4 cup sesame seeds","4 large garlic cloves, minced","4 teaspoons curry powder"],"sodium":99.0}
{"title":"Asian Garlic Chicken","directions":["Whisk vinegar, chicken broth, garlic, soy sauce and pepper in small bowl to blend. Season chicken breast halves on both sides with seasoning mix. Heat oil in heavy large skillet over medium-high heat. Add chicken and sautéuntil golden, about 4 minutes per side. Pour vinegar mixture over chicken. Add bay leaves. Reduce heat to low, cover skillet and simmer until chicken is just cooked through, about 10 minutes. Using tongs, transfer chicken to plate. Boil pan juices 2 minutes. Season to taste with salt. Spoon over chicken, discarding bay leaves. Serve with rice."],"fat":10.0,"date":"2004-08-20T04:00:00.000Z","categories":["Chicken","Garlic","Poultry","Quick \u0026 Easy","Low Cal","Winter","Bon Appétit","California"],"calories":347.0,"desc":"Dorothy Duder North Hollywood, California","protein":55.0,"rating":3.75,"ingredients":["1/2 cup distilled white vinegar","1/2 cup canned low-salt chicken broth","10 large garlic cloves, chopped","2 1/2 tablespoons soy sauce","1/4 teaspoon ground pepper","4 skinless boneless chicken breast halves","2 teaspoons onion-herb seasoning mix (such as Mrs. Dash)","1 tablespoon oriental sesame oil","3 large bay leaves","Cooked white rice"],"sodium":667.0}
{"title":"Chicken Marsala with Sage","directions":["Sprinkle chicken with salt and pepper. Dust with flour; shake off excess. Melt 3 tablespoons butter in large skillet over medium-high heat. Add chopped sage; sauté 1 minute. Add half of chicken. Sauté until brown and cooked through, about 3 minutes per side. Transfer chicken to platter. Repeat with remaining butter and chicken. Tent chicken with foil. Add Marsala and broth to skillet; bring to boil, scraping up any browned bits. Boil until sauce is reduced to 1/2 cup, about 10 minutes. Season with salt and pepper; spoon over chicken. Garnish with sage leaves."],"fat":24.0,"date":"2004-08-20T04:00:00.000Z","categories":["Chicken","Sauté","Marsala","Sage","Bon Appétit"],"calories":494.0,"desc":"","protein":55.0,"rating":4.375,"ingredients":["4 skinless boneless chicken breast halves, each halved horizontally","All purpose flour","6 tablespoons (3/4 stick) butter","1 tablespoon chopped fresh sage","1 cup imported dry Marsala","1 cup canned low-salt chicken broth","Fresh sage leaves"],"sodium":129.0}
{"title":"Poached Chicked with Curried Yogurt Sauce","directions":["Combine first 4 ingredients in a small bowl; whisk to blend. Season with salt and pepper.(Can be made 1 day ahead. Cover; chill. Bring to room temperature before serving.)","Arrange chicken in a single layer in heavy medium skillet. Add enough broth to cover chicken and bring to boil. Cover skillet and turn off heat. Let stand until chicken is cooked through, about 20 minutes. Using tongs, transfer chicken to plates. Cut chicken crosswise into thin slices. Spoon yogurt sauce over chicken."],"fat":4.0,"date":"2004-08-20T04:00:00.000Z","categories":["Chicken","Poach","Yogurt","Lime","Curry","Summer","Bon Appétit","Australia"],"calories":106.0,"desc":"The Mango and Red Onion Salsa is nice alongside this low-fat entreé.","protein":11.0,"rating":3.125,"ingredients":["1 cup plain low-fat yogurt","1/4 cup fresh lime juice","2 teaspoons ground cumin","2 teaspoons curry powder","4 skinless boneless chicken breast halves","2 cups (or more) canned low-salt chicken broth"],"sodium":95.0}
{"title":"Panfried Chicken Breasts with Oregano Garlic Butter","directions":["Mince garlic and mash to a paste with salt using a large heavy knife.","Mash together butter, oregano, red pepper flakes, and garlic paste with a fork until well blended.","Pat chicken dry. Cut a 2-inch-long pocket horizontally in side of each chicken breast half and fill each pocket with 2 teaspoons oregano garlic butter. Season chicken with salt and pepper.","Heat oil in a 12-inch heavy skillet over moderately high heat until hot but not smoking, then cook chicken, skin sides down, uncovered, until well browned, 8 to 10 minutes. Turn chicken over and cover skillet, then cook until chicken is just cooked through, about 10 minutes more. Spread remaining oregano garlic butter over skin of chicken."],"fat":107.0,"date":"2004-08-20T04:00:00.000Z","categories":["Chicken","Garlic","Herb","Quick \u0026 Easy","Low/No Sugar","Summer","Pan-Fry","Oregano","Gourmet"],"calories":1818.0,"desc":"Cooking chicken breasts on the bone keeps them exceptionally juicy.","protein":201.0,"rating":3.75,"ingredients":["1 garlic clove","1/4 teaspoon salt","5 tablespoons unsalted butter, softened","1 tablespoon chopped fresh oregano","1/4 teaspoon dried hot red pepper flakes","4 chicken breast halves with skin and bones (2 to 2 1/4 lb)","1 tablespoon olive oil"],"sodium":755.0}
{"title":"Rosemary-Roasted Chicken and Garlic","directions":["Preheat oven to 475°F. Run fingers under skin of chicken breasts to loosen; rub 1/2 teaspoon rosemary under skin of each. Sprinkle chicken with salt and pepper; place in medium ovenproof skillet. Toss garlic, oil and remaining 1 teaspoon rosemary in small bowl to coat. Arrange garlic around chicken. Drizzle any remaining oil mixture over chicken.","Roast chicken 15 minutes. Add broth to skillet. Continue to roast until chicken is cooked through, about 5 minutes. Transfer chicken and garlic to plates. Add wine to skillet; boil 1 minute to reduce pan juices slightly. Spoon pan juices over chicken and garlic."],"fat":31.0,"date":"2004-08-20T04:00:00.000Z","categories":["Chicken","Garlic","Herb","Roast","Low Carb","Quick \u0026 Easy","Back to School","Dinner","Fall","Family Reunion","Bon Appétit"],"calories":570.0,"desc":"Complete the main course with buttered sweet potato chunks (they can roast alongside the chicken) and sautéed Swiss chard. Serve purchased éclairs for dessert.","protein":57.0,"rating":3.75,"ingredients":["2 chicken breast halves with skin and bones","2 teaspoons minced fresh rosemary","10 large garlic cloves, peeled","1 tablespoon olive oil","1/2 cup canned low-salt chicken broth","1/3 cup dry white wine"],"sodium":188.0}
{"title":"Herb-Roasted Chicken Breasts","directions":["Preheat oven to 375°F. Combine garlic, rosemary and thyme in small bowl. Arrange chicken in large roasting pan Sprinkle chicken with salt and pepper. Rub with garlic mixture; drizzle with olive oil. Pour wine into bottom of pan. Bake chicken until just cooked through, about 30 minutes. Remove from oven.","Preheat broiler. Broil chicken until skin browns, about 3 minutes. Transfer chicken to platter and serve."],"fat":30.0,"date":"2004-08-20T12:48:48.000Z","categories":["Chicken","Herb","Poultry","Roast","Low Cal","Spring","Bon Appétit"],"calories":510.0,"desc":"","protein":53.0,"rating":3.75,"ingredients":["3 large garlic cloves, chopped","1 tablespoon chopped fresh rosemary","1 tablespoon chopped fresh thyme","6 large chicken breast halves with skin and bones","3 tablespoons olive oil","1/3 cup dry white wine"],"sodium":162.0}
{"title":"Chicken with Mushrooms and White Wine","directions":["Sprinkle chicken with salt and pepper; dust with flour. Heat oil in heavy large skillet over medium-high heat. Add chicken; sauté until brown, about 4 minutes per side. Transfer to plate. Add mushrooms, shallots and herbs to skillet. Sauté until mushrooms are cooked through and juices are reduced to glaze, about 12 minutes.","Add broth and wine to skillet. Boil until reduced by half, about 8 minutes. Return chicken to skillet. Simmer until chicken is cooked through and liquid thickens to sauce consistency, about 6 minutes. Season with salt and pepper. Transfer chicken and sauce to plates."],"fat":24.0,"date":"2004-08-20T04:00:00.000Z","categories":["Chicken","Herb","Mushroom","Sauté","Quick \u0026 Easy","White Wine","Bon Appétit","Ireland"],"calories":504.0,"desc":"","protein":45.0,"rating":3.75,"ingredients":["4 boneless chicken breast halves, with skin","All purpose flour","2 tablespoons vegetable oil","1 1/4 pounds mushrooms, sliced","4 large shallots, chopped","1 1/2 tablespoons chopped fresh thyme or 1 1/2 teaspoons dried","1 1/2 tablespoons chopped fresh tarragon or 1 1/2 teaspoons dried","1 1/2 cups canned low-salt chicken broth","1 cup dry white wine"],"sodium":156.0}
{"title":"Pat\u0027s Chicken with Peaches and Jalapenos","directions":["Preheat oven to 450° F.","Season chicken breasts with salt and pepper and arrange, skin sides up, in an 18- by 11 1/2-inch roasting pan. Drizzle chicken with oil and roast 20 minutes. Scatter peaches, onions, jalapeños, garlic, and lemon over and around chicken.","Reduce temperature to 375° F. and roast chicken, covered with foil, 30 minutes more. Remove foil and roast chicken, basting occasionally with pan juices, until peaches and onions are soft, about 30 minutes more. Transfer chicken mixture to a platter, spooning any pan juices over it.","Serve chicken with rice."],"fat":16.0,"date":"2004-08-20T12:48:48.000Z","categories":["Chicken","Fruit","Pepper","Poultry","Roast","Peach","Summer","Gourmet","New York"],"calories":355.0,"desc":"","protein":30.0,"rating":3.75,"ingredients":["2 whole chicken breasts with skin and bones (about 2 pounds total), halved","1 tablespoon olive oil","3 firm-ripe peaches, quartered","3 medium onions, quartered lengthwise","6 jalapeño chilies, quartered lengthwise and seeded (wear rubber gloves)","6 large garlic cloves","1 lemon, quartered","Accompaniment: basmati rice"],"sodium":88.0}
{"title":"Chicken with Vegetables and Parsley Dumplings","directions":["Preheat oven to 400°F. Heat oil in large ovenproof skillet over medium heat. Sprinkle chicken leg-thigh pieces with salt and pepper. Add chicken to skillet and cook until golden brown, about 5 minutes per side. Add 1-inch pieces of celery, onion, and carrot, and bay leaf. Cook until vegetables begin to soften, stirring occasionally, about 8 minutes. Add wine and stir 1 minute, scraping up browned bits. Add broth, cover, and braise in oven until chicken is tender, about 40 minutes.","Transfer chicken to plate. Strain broth into medium bowl, pressing on solids to release liquid. Discard solids in strainer. Remove meat from leg-thigh chicken pieces and transfer to bowl. Discard skin and bones. DO AHEAD: Broth and chicken can be made 1 day ahead. Cover broth and chicken separately and refrigerate.","Cook sugar snap peas and chopped celery in large saucepan of boiling salted water until crisp-tender, about 1 minute. Using slotted spoon, transfer vegetables to bowl of ice water to cool. Cook baby carrots in same water until crisp-tender, about 5 minutes. Using slotted spoon, transfer to same bowl of ice water to cool. Cook pearl onions in same water until tender, about 8 minutes. Using slotted spoon, transfer to bowl of ice water to cool. Trim root end of onions; peel. Transfer sugar snap peas, celery, baby carrots, and pearl onions to medium bowl. DO AHEAD: Can be made 1 day ahead. Cover and refrigerate.","Melt butter in heavy very large skillet or large pot over medium-high heat. Sprinkle chicken breast pieces with salt and pepper; add chicken to skillet and sauté 2 minutes. Sprinkle with flour and stir over medium-low heat until chicken is just cooked through, about 8 minutes. Stir in reserved chicken leg-thigh meat, chicken broth, sugar snap peas, celery, carrots, pearl onions, cream, parsley, and thyme. Stir until vegetables are warm and sauce thickens slightly, about 5 minutes. Season chicken and vegetables to taste with salt and pepper. Stir in dumplings and simmer until dumplings are warmed through, about 1 minute."],"fat":28.0,"date":"2006-09-01T16:54:51.000Z","categories":["Milk/Cream","Chicken","Dairy","Onion","Vegetable","Sauté","White Wine","Fall","Simmer","Bon Appétit"],"calories":532.0,"desc":"","protein":51.0,"rating":3.125,"ingredients":["3 tablespoons olive oil","4 whole leg-thigh chicken pieces","2 celery stalks, cut into 1-inch pieces","1 onion, cut into 1-inch pieces","1 large carrot, peeled, cut into 1-inch pieces","1 bay leaf","1/2 cup dry white wine","4 cups low-salt chicken broth","1 cup sugar snap peas, trimmed","1/2 cup chopped celery","1 cup baby carrots","12 pearl onions","3 tablespoons butter","4 skinless boneless chicken breast halves, cut into 1-inch cubes","3 tablespoons all purpose flour","1/4 cup whipping cream","1 tablespoon chopped fresh Italian parsley","1 teaspoon chopped fresh thyme","Parsley dumplings"],"sodium":203.0}
{"title":"Spicy Chicken Cacciatore","directions":["Sprinkle chicken with salt and pepper. Heat oil in large skillet over medium-high heat. Add chicken, skin side down, and sauté unt